{"title": ["PREMIS IMPLEMENTATION FAIR WORKSHOP: Exchanging Experiences using PREMIS"], "date": ["2023-09", "2023-11-01T13:54:59-05:00"], "type": ["text"], "subject": ["PREMIS", "Preservation", "Metadata", "Preservation Metadata"], "creator": ["Lindlar, Micky", "Bredenberg, Karin", "Romkey, Sarah", "Steeman, Marjolein"], "description": ["This workshop functions as a meeting ground for PREMIS practitioners, researchers, and curious onlookers. As opposed to PREMIS tutorials, which focus on introducing the data model and data dictionary, the PREMIS Implementation Fair focuses on work currently undertaken by the Editorial Committee as well as on real-world implementations, projects and open questions that the digital preservation community has around preservation metadata."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121051", "source_url": "https://hdl.handle.net/2142/121051", "pdf_url": "https://www.ideals.illinois.edu/items/128255/bitstreams/428875/data.pdf"}
{"title": ["SERVER-SIDE WEB ARCHIVING USING REPROZIP-WEB"], "date": ["2023", "2023-11-01T14:31:29-05:00"], "type": ["text"], "subject": ["Dynamic web archiving", "Server-side web archiving", "ReproZip-Web", "Webrecorder"], "creator": ["Boss, Katherine", "Kreymer, Ilya", "Rampin, Vicky", "Rampin, Rémi"], "description": ["Current client-side, or “static,” web archiving crawlers have been tremendously successful in capturing and archiving millions of pages of the internet. Unfortunately, over the decades the web has evolved beyond the reach of many of these crawlers, and today’s static crawlers fail to capture the look, feel, and functionality of a significant amount of interactive web content, including maps, visualizations, database-reliant projects and social media feeds. Archiving these dynamic websites requires a different approach, including a server- side web archiving option.\nReproZip-Web is an open source, grant-funded [1] web-archiving tool that can address this need. It builds on the high-fidelity crawling tools of Webrecorder by also encapsulating a dynamic web server software and its dependencies. The output is a self-contained, isolated, and preservation-ready bundle, an .rpz file, with all the information needed to replay a website, including the source code, the computational environment (e.g., the operating system, software libraries) and the files used by the app (e.g. data, static files). Its lightweight nature makes it ideal for distribution and preservation.\nThis interactive workshop will be particularly useful for web archivists, digital archivists, digital humanities scholars and others seeking to archive and preserve\ncomplex web projects. Attendees, who should be familiar with the command line interface, will practice packing and tracing a web application and recording the front-end of the site using ReproZip-Web. They will then be able to test replaying the site from the newly created and preservable .rpz file."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121052", "source_url": "https://hdl.handle.net/2142/121052", "pdf_url": "https://www.ideals.illinois.edu/items/128256/bitstreams/428877/data.pdf"}
{"title": ["PRESERVING EMAIL ATTACHMENTS WITH ATTACHMENT CONVERTER"], "date": ["2023", "2023-11-01T14:38:28-05:00"], "type": ["text"], "subject": ["email", "MIME", "attachment", "digital preservation", "digital formats"], "creator": ["Teichman, Matt", "Gosselar, Ashley", "Obetta, Obi", "Karle, Nishchay"], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121053", "source_url": "https://hdl.handle.net/2142/121053", "pdf_url": "https://www.ideals.illinois.edu/items/128257/bitstreams/428879/data.pdf"}
{"title": ["STORAGE AND STANDARDS: Shaping Version 4 of the DP Storage Criteria"], "date": ["2023", "2023-11-01T14:43:07-05:00"], "type": ["text"], "subject": ["preservation storage", "standards"], "creator": ["Goethals, Andrea", "Wu, Cynthia", "Zierau, Eld", "Schaefer, Sibyl", "McGovern, Nancy"], "description": ["The Digital Preservation Storage Criteria (“Criteria”) are designed to provide community guidance for organizations that either use or provide digital preservation storage. Currently on its fourth iteration, the Criteria have been mapped to relevant information security and digital preservation standards such as ISO 14721 (OAIS) and ISO 16363 (Audit and certification of trustworthy digital repositories). This standards mapping exercise has led to many changes in the Criteria. The authors propose a workshop to get feedback from participants on key elements of the draft fourth version of the Digital Preservation Storage Criteria (“Criteria”). \nThis workshop will provide participants with an introduction to the Criteria and then will lead the participants in group exercises designed to test the assumptions and work behind draft version 4 of the Criteria. The expected outcomes are a deeper understanding of considerations for digital preservation storage by the participants, and feedback to the Criteria working group on draft version 4 before it is published after the conference."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121054", "source_url": "https://hdl.handle.net/2142/121054", "pdf_url": "https://www.ideals.illinois.edu/items/128258/bitstreams/428881/data.pdf"}
{"title": ["CONTINUOUS IMPROVEMENT TOOLS FOR DEVELOPING CAPACITY AND SKILLS: A Tutorial"], "date": ["2023", "2023-11-01T14:48:35-05:00"], "type": ["text"], "subject": ["Maturity modelling", "skills", "good practice", "continuous development", "benchmarking"], "creator": ["McMeekin, Sharon", "Mitcham, Jenny", "Currie, Amy"], "description": ["The ability to apply a carefully considered and well implemented approach to continuous improvement of digital preservation capabilities can greatly benefit practitioners when looking to set and achieve objectives. This tutorial aims to provide attendees with the skills and tools to develop and implement a methodology for continuous improvement at their organization using resources developed by the Digital Preservation Coalition. This will include assessing maturity with the Rapid Assessment Model and auditing skills with the Competency Framework and Audit Toolkit."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121055", "source_url": "https://hdl.handle.net/2142/121055", "pdf_url": "https://www.ideals.illinois.edu/items/128259/bitstreams/428883/data.pdf"}
{"title": ["UNDERSTANDING AND IMPLEMENTING METS: A tutorial focused on METS 2"], "date": ["2023", "2023-11-01T14:53:11-05:00"], "type": ["text"], "subject": ["Metadata and information strategies and workflows", "Infrastructure, systems, and tools", "Case studies, best practices and novel challenges", "Training and education for a new version"], "creator": ["Bredenberg, Karin", "Elkiss, Aaron", "Lehtonen, Juha"], "description": ["This half day tutorial will provide participants with an introduction to the Metadata Encoding and Transmission Standard (METS) starting in METS version 1 and the METS Primer [1], but focusing on METS version 2. It will give a basic overview of METS and explore different models of implementation. The METS schema is a standard for encoding descriptive, administrative, and structural metadata regarding objects within a digital library as well as digital archives, expressed using the XML schema language of the World Wide Web Consortium. It is maintained by the METS Editorial Board, and the METS Maintenance Activity is managed by the Library of Congress [2]."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121056", "source_url": "https://hdl.handle.net/2142/121056", "pdf_url": "https://www.ideals.illinois.edu/items/128260/bitstreams/428885/data.pdf"}
{"title": ["TUTORIAL: UP AND RUNNING WITH ARK PERSISTABLE IDENTIFIERS"], "date": ["2023", "2023-11-01T14:57:33-05:00"], "type": ["text"], "subject": ["persistent identifier", "open access", "URL", "URI"], "creator": ["Kunze, John", "Winston, Donny"], "description": ["This half-day (3-hour) tutorial is a pragmatic introduction to the Archival Resource Key (ARK), a 22-year-old, non-paywalled identifier scheme that is widely used for persistent access to cultural and scientific information. By the end of the tutorial, attendees will know when this highly flexible scheme is appropriate to use and how to create ARKs for their respective memory organizations. No prior experience is required."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121057", "source_url": "https://hdl.handle.net/2142/121057", "pdf_url": "https://www.ideals.illinois.edu/items/128261/bitstreams/428887/data.pdf"}
{"title": ["HOW TO PRESERVE RESEARCH DATASETS: LABDRIVE Tutorial"], "date": ["2023", "2023-11-01T15:01:42-05:00"], "type": ["text"], "subject": ["Research Data Management", "Digital Preservation", "Software"], "creator": ["Martinez, Antonio Guillermo", "Fuertes, Maria"], "description": ["LABDRIVE is a Research Data Management and Digital Preservation platform that allows organizations to capture the research data they produce, helping them to properly manage, preserve and allow access to it, during the whole research data lifecycle, unifying and simplifying their research data management strategies.\nThe purpose of this tutorial is to introduce the design principles of LABDRIVE as well as explain how it works through a tutorial (a guided demonstration)."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121058", "source_url": "https://hdl.handle.net/2142/121058", "pdf_url": "https://www.ideals.illinois.edu/items/128262/bitstreams/428889/data.pdf"}
{"title": ["THIS IS FEDORA 6.X: Understanding the Oxford Common File Layout, Intro to Migration Tools and Understanding Community Developed Integrations"], "date": ["2023", "2023-11-01T15:05:54-05:00"], "type": ["text"], "subject": ["Fedora", "Repository", "Open Source", "Migrations"], "creator": ["Griffith, Arran", "Field, Dan"], "description": ["Fedora 6.x is the newest, most modern version of the software, representing a significant change in the preservation standards and backend infrastructure from previous versions. This modernization of the software provides users a more robust preservation platform, while giving the community back the data transparency they appreciated from Fedora 3. This workshop will provide participants with the ability to work directly with the newest version of Fedora through hands-on exercises as well as learning about the Oxford Common File Layout (OCFL) and it’s role in digital preservation within a Fedora ecosystem. We will complete a sample migration using the Migration Toolkit, a series of instructional modules created from an IMLS grant-funded project, and gain experience working with the migration utility and validator tools. Lastly we will explore several community-developed integrations that allow for additional functionality and visibility into the contents within a Fedora repository.\nThis workshop is intended to provide participants an opportunity to work directly with the software, understand it’s preservation features and become familiar with the recently developed tools for migrating from Fedora 3.x to 6.x."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121059", "source_url": "https://hdl.handle.net/2142/121059", "pdf_url": "https://www.ideals.illinois.edu/items/128263/bitstreams/428891/data.pdf"}
{"title": ["DIGITAL ACCESSIBILITY, INCLUSION AND DIVERSITY: Digitization of Indigenous Agricultural Knowledge in Shaping Food Security across the Kenyan Coastal Region"], "date": ["2023", "2023-11-01T15:33:31-05:00"], "type": ["text"], "subject": ["Digital accessibility", "indigenous agricultural knowledge"], "creator": ["Kenga, Maureen"], "description": ["According to Gilman (1917), food problem is related to three questions: First, “how to produce the most food with the least cost in time, labor and money,” second, how to swiftly, efficiently and economically distribute it to consumers, and, third, how to prepare and serve healthy food, without spending too much money, time, and effort. Since then, considerable progress has been made in improving food supply and facilitating meal preparation. This paper looks at the importance of digitizing the indigenous farming methods that can be incorporated with the emerging trends in present agriculture playing a significant role in ensuring food security. This paper is submitted to iPRESS 2023 as a poster aimed at improving indigenous agricultural knowledge with a base for new capabilities in providing solutions matters food security"], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121060", "source_url": "https://hdl.handle.net/2142/121060", "pdf_url": "https://www.ideals.illinois.edu/items/128264/bitstreams/428893/data.pdf"}
{"title": ["THE WHAT, WHY AND HOW OF A DIGITAL PRESERVATION DPS: The process by which a Dynamic Purchasing System for Digital Preservation service may (or may not) be adopted"], "date": ["2023", "2023-11-01T15:37:30-05:00"], "type": ["text"], "subject": ["Dynamic Purchasing system", "Jisc", "Procurement"], "creator": ["Stokes, Paul", "Colbron, Karen"], "description": ["Jisc are considering implementing a Dynamic Purchasing system for members to use when procuring a Digital Preservation System. This poster shows what a DPS is and the process we’re undergoing to decide if we will provide a DPS. In effect, how we’re building a robust business case to provide a DPS for our members."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121062", "source_url": "https://hdl.handle.net/2142/121062", "pdf_url": "https://www.ideals.illinois.edu/items/128266/bitstreams/428895/data.pdf"}
{"title": ["GIVING ACCESS TO BORN-DIGITAL ARCHIVES AT THE ARCHIVES NATIONALES (FRANCE): The OeDIPus riddle"], "date": ["2023", "2023-11-01T15:53:55-05:00"], "type": ["text"], "subject": ["access", "DIP", "integrity", "fixity", "checksum"], "creator": ["Levasseur, Emeline", "Falut, André", "Fenech, Julien", "Ferrera, Matias"], "description": ["Born-digital archives, managed in a repository, are accessible thanks to the delivery of Dissemination Information Packages (DIP). While the DIP is a machine-readable format, it is not easily intelligible for the end user. In practice, making DIP truly accessible appears like a riddle. To make it more human-readable, a DIP must undergo some processing outside the repository and be converted in a new form, which should be discussed. These operations call into question the integrity of the archives, which was ensured until their delivery by the system. How, then, can archivists keep data trustworthy? Following recent requests for access, the Archives nationales (France) have provided some answers that could be used as a basis for discussion to solve this OeDIPus riddle. Their experience was one of moving from theory to practice, leading to the creation of an in-house proof-of-concept (POC) and tool: OE-DIP (Objets et Empreintes de DIP, Objects and Checksums of DIP)."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121063", "source_url": "https://hdl.handle.net/2142/121063", "pdf_url": "https://www.ideals.illinois.edu/items/128267/bitstreams/428899/data.pdf"}
{"title": ["ESTABLISHING AN OPEN-SOURCE PACKAGE “ARCHIVE\""], "date": ["2023", "2023-11-01T16:03:21-05:00"], "type": ["text"], "subject": ["emulation", "software preservation", "open-source"], "creator": ["Cochrane, Euan", "Gieschke, Rafael"], "description": ["Many Linux-based operating systems use a package management system that enables users to install a wide range of applications using one or more simple workflows, without needing to find and download the applications from their original publishers. The package management systems also resolve dependencies for users by finding and installing any dependent-applications or “packages” that are needed in order to run the application that the user is trying to install.  These workflows greatly improve the experience of working with the operating systems and save a great deal of time for the end-users. When setting up the Emulation as a Service Infrastructure (EaaSI) platform to work with Linux-based operating systems we have encountered a number of issues when working with the operating systems’ built-in Package Management Systems (PKMS). The PKMSs usually include a list of servers that host the packages that the PKMS can install for the user. We have found that often those lists are out-of-date and point to servers that no longer exist. In some cases, it is impossible or nearly impossible to find alternative servers that are still actively serving the packages, and where they are available the speed/bandwidth is often much slower/limited for packages for older operating system versions than it was when the operating systems were current. Even when an alternative server can be found that is still actively serving the packages for a legacy operating system, the average end-user can often struggle to understand how to point the PKMS at a custom server as this often requires editing relatively obscure configuration files within the Operating System. \nTo address these issues the EaaSI program of work and Yale University Library have launched a spin-off project to create a central “archive”  of compiled, open-source software packages. The “archive” will host copies of packages for many versions of legacy operating systems and make them freely available to any users, whether working with EaaSI or using the legacy operating systems in other contexts. The archive is hosted directly on a public S3-compatible bucket without an additional frontend server to improve availability, reduce maintainability, allow for practically limitless scaling, and enable users to easily explore and clone its contents (or parts thereof). In addition, the EaaSI software is being updated to enable instance administrators to configure the platform to automatically re-route connections being made to the package servers configured as defaults in legacy Linux-based operating systems and dynamically and seamlessly re-map the connections to the appropriate locations in the new package “archive”. This is achieved either by automatically manipulating the DKMS’s configuration files or by transparently routing network requests to the originally configured domain to an emulated version of the DKMS’s server in a virtual network running in EaaSI.\nUnlike Software Heritage [1], the world’s preeminent archive of software source code, this project aims to primarily maintain an archive of compiled binaries and not the application source code. While there are some operating systems that use a PKMS that dynamically compiles from source code when installing applications, these are rare  and we are comfortable with the possibility of overlapping with the work of the software heritage team in this limited area. \nThere is a wide scope of future work for this project. In spite of being comfortable mildly overlapping on the work of the Software Heritage team, we are also interested in potentially creating reproducible builds of the packages in our “archive” within the EaaSI platform, using source code Sourced from Software Heritage. Doing the compilation from source within the EaaSI platform would provide an audit trail to further strengthen the trustworthiness of the packages provided in our “archive”.\nAnother future extension will be enabling sourcing packages from multiple sources, so that users can use one URL for any version of the same operating system, even if the packages were originally collected from different origin servers by our project. Here, a useful addition could be to seamlessly provide provenance information in S3 for individual packages, i.e., individual files in a directory sourced from multiple different origins.\nIn the regular use and development of repositories used by PKMSs the specific versions of the packages supplied by the repository are regularly updated and changed. IT is conceivable that users of our archive would need access to a specific version of a package, something that might not be possible if we only included the last version made available in the original repository. Therefore, a further (but much more elaborate) future extension could be to include different versions of the same package, a service offered for Debian at https://snapshot.debian.org/.\nFurther developments could include archiving the repositories of other package managers used in non-operating system contexts, e.g., PKMSs used for acquiring libraries for programming languages, for example., the Python Package Index (PyPI), Node.js’ npm, or various Docker registries (e.g., DockerHub, GitHub Container Registry). Here, a particular focus could be on providing time-travel functionality (as offered by snapshot.debian.org) as software projects often do not fully specify their required library versions (e.g., by only specifying a minimum version instead of an exact version) and do not work anymore when newer versions of their required libraries become available at a later time and are selected by the package manager. Here, a bigger focus would probably be on the integration into the system than on duplicating the archive.\n\nIn this poster, we will provide a visual overview of the plans outlined in this extended abstract and hope to use it to raise awareness of the “archive” in order to ensure extensive use of it once it is available."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121064", "source_url": "https://hdl.handle.net/2142/121064", "pdf_url": "https://www.ideals.illinois.edu/items/128268/bitstreams/428901/data.pdf"}
{"title": ["PROCURING IT SYSTEMS: Thinking about digital preservation from the start"], "date": ["2023", "2023-11-01T16:07:40-05:00"], "type": ["text"], "subject": ["Procurement", "IT systems", "data export"], "creator": ["Popham, Michael", "Mitcham, Jenny", "Wheatley, Paul"], "description": ["This poster presents one of the final outputs produced from a collaborative project between the Digital Preservation Coalition and the Nuclear Decommissioning Authority in the UK, “Digital preservation requirements for procuring IT systems”. This addition to the Digital Preservation Coalition’s Procurement Toolkit proposes the requirements that should be considered when procuring an IT system (for example an EDRMS, DAMS, or GIS) that may ultimately contain at least some records or digital content that needs to be retained beyond the life of the system."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121065", "source_url": "https://hdl.handle.net/2142/121065", "pdf_url": "https://www.ideals.illinois.edu/items/128269/bitstreams/428903/data.pdf"}
{"title": ["EMBEDDING PRESERVABILITY: IFRAMES IN COMPLEX SCHOLARLY PUBLICATIONS"], "date": ["2023", "2023-11-01T16:12:23-05:00"], "type": ["text"], "subject": ["websites", "publishing", "publications"], "creator": ["Hanson, Karen", "Greenberg, Jonathan", "Guicherd-Callin, Thib", "Witmer, Scott", "Spinazzè, Angela T."], "description": ["As part of a research project, a small team of preservation experts has been embedded within publisher workflows to analyze the challenges associated with preserving complex scholarly publications. As the project reaches the midway point, patterns are emerging regarding preservation-friendly practices that could potentially be incorporated into production processes and platforms to support preservation at scale. One common threat to the preservability of the analyzed publications is the inclusion of web pages that are hosted by a third party (e.g., YouTube videos, ArcGIS visualizations) within the text using iframes. The team is exploring methods to improve preservability in such instances while considering the constraints of the project partners and the requirement that preservation services can scale their processes across numerous publications."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121066", "source_url": "https://hdl.handle.net/2142/121066", "pdf_url": "https://www.ideals.illinois.edu/items/128270/bitstreams/428905/data.pdf"}
{"title": ["PLUS ÇA CHANGE…?: Eight years after the end of the 4C project, what next for the Curation Costs Exchange?"], "date": ["2023", "2023-11-01T16:15:49-05:00"], "type": ["text"], "subject": ["4C Project", "Sustainability", "Community consultation", "CCEx", "CCT"], "creator": ["Stokes, Paul", "Middleton, Sarah"], "description": ["– A poster describing the functionality of the Curations Costs Exchange and the Cost Comparison Tool (outputs of the 4C Project), how they’ve been used by the community, considerations underway regarding their future, the mechanism used to consult the community and (assuming the consultation and considerations are complete) their ultimate fate."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121067", "source_url": "https://hdl.handle.net/2142/121067", "pdf_url": "https://www.ideals.illinois.edu/items/128271/bitstreams/428907/data.pdf"}
{"title": ["INTRODUCING TABULA: The University of Minnesota Libraries Digital Preservation System"], "date": ["2023", "2023-11-01T16:19:09-05:00"], "type": ["text"], "subject": ["digital preservation", "digital preservation system", "libraries", "implementation"], "creator": ["Kussmann, Carol"], "description": ["The University of Minnesota Libraries journey with preserving digital materials has been a long one.  After completing an RFP for a preservation system, and then testing that system for multiple years, we decided it was not the system for us. Over 2021 and 2022, we took our requirements along with the lessons we learned from testing, and began to design our own preservation system.  Our main goal with this new system is to preserve the unique materials of the Libraries and to be able to provide access to staff that need copies of preservation files for publication or research requests.  This poster highlights the development process of Tabula, our digital preservation system."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121068", "source_url": "https://hdl.handle.net/2142/121068", "pdf_url": "https://www.ideals.illinois.edu/items/128272/bitstreams/428909/data.pdf"}
{"title": ["METADATA THAT EXCLUDES: A Case Study of the Rock Springs Massacre in Digital Collections"], "date": ["2023", "2023-11-01T16:22:58-05:00"], "type": ["text"], "subject": ["metadata", "digital collections", "archival silence"], "creator": ["Han, Yingying", "Han, Ruohua", "Wickett, Karen M."], "description": ["This poster presents the preliminary findings of a project that analyzes archival materials about the 1885 Rock Springs Massacre to understand archival silences around the experiences of Chinese people in the United States. We observed that metadata contributes to the exclusion of Chinese people through absent categories, overly narrow subject descriptions, and an emphasis on foreignness and otherness. Future work will identify points of intervention in digital preservation to address these issues."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121069", "source_url": "https://hdl.handle.net/2142/121069", "pdf_url": "https://www.ideals.illinois.edu/items/128273/bitstreams/428911/data.pdf"}
{"title": ["A NATIONAL REPOSITORY PLATFORM FOR SHARING THE CHALLENGES OF LONG-TERM DIGITAL CURATION OF RESEARCH DATA"], "date": ["2023", "2023-11-01T16:27:04-05:00"], "type": ["text"], "subject": ["Research data", "curation", "preservation", "sustainable model", "open access", "digital repository"], "creator": ["Shaon, Arif", "Werla, Marcin", "Alkhaja, Alwaleed"], "description": ["Qatar National Library has launched a research repository named Manara to address the need for curating, preserving, and enabling Open Access to Qatari research output. The repository aims to operate on a consortium-based service model that allows sharing the overall responsibility of curating and preserving a wide variety of research outputs between the Library and key partner institutions, thereby developing a sustainable ecosystem for research outputs in Qatar. The poster presents the work done to establish Manara, including the underlying technical and operational model."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121070", "source_url": "https://hdl.handle.net/2142/121070", "pdf_url": "https://www.ideals.illinois.edu/items/128274/bitstreams/428913/data.pdf"}
{"title": ["FROM REDACTION TO ACCESS: Navigating Challenges to Unlock Houston's LGBTQ Media History"], "date": ["2023", "2023-11-01T16:30:47-05:00"], "type": ["text"], "subject": ["LGBTQ Community", "Broadcast archives", "Audiovisual archives", "Digital preservation", "Accessibility"], "creator": ["Vinson, Emily", "Scott, Bethany"], "description": ["The Gulf Coast LGBT Radio and Television Digitization Project launched in 2020 to digitize, preserve, describe, and make accessible thousands of hours of Houston’s LGBTQ broadcast history. The authors explain the significance of the programs selected for inclusion in the project and describe the steps taken to balance the goal of equitable access to unique materials created by and for a marginalized community, while maintaining adherence to copyright restrictions."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121071", "source_url": "https://hdl.handle.net/2142/121071", "pdf_url": "https://www.ideals.illinois.edu/items/128275/bitstreams/428915/data.pdf"}
{"title": ["PREMIS IN A PAGE: A beginner’s guide to the PREMIS Data Model"], "date": ["2023", "2023-11-01T16:35:18-05:00"], "type": ["text"], "subject": ["PREMIS", "Metadata", "Data Model", "Preservation Metadata"], "creator": ["Zierau, Eld", "O’Sullivan, Jack", "Bredenberg, Karin"], "description": ["This poster from the PREMIS Editorial Committee will provide a high level overview of the PREMIS data model, aimed at providing an introduction to those who are unfamiliar with it."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121072", "source_url": "https://hdl.handle.net/2142/121072", "pdf_url": "https://www.ideals.illinois.edu/items/128276/bitstreams/428917/data.pdf"}
{"title": ["CREATING DIGITAL PRESERVATION PLANS: Leveraging Expertise Across Your Organization"], "date": ["2023", "2023-11-01T17:01:25-05:00"], "type": ["text"], "subject": ["digital preservation", "leveraging expertise", "digital preservation planning"], "creator": ["Kramer-Smyth, Jeanne", "Gkremo, Thomas", "Thompson, Sherrine"], "description": ["The creation of Digital Preservation Plans requires leveraging a wide range of archival expertise. Our panel will discuss each of the components we have identified for inclusion in our preservation plans, along with specific skills and knowledge we depend upon from different parts of our team. Learn how we use a standard framework and leverage the expertise and enthusiasm of our Appraisal, Transfer, Ingest, and Arrangement and Description teams to create thorough and functional Digital Preservation Plans. Session will include recommendations of how to apply our approach at your institution."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121073", "source_url": "https://hdl.handle.net/2142/121073", "pdf_url": "https://www.ideals.illinois.edu/items/128277/bitstreams/428919/data.pdf"}
{"title": ["FROM THEORY TO PRACTICE: UNDERSTANDING THE EVOLUTION OF A DIGITAL PRESERVATION PROJECT FROM CONCEPTION TO FINAL REPOSITORY Some real cases"], "date": ["2023", "2023-11-01T17:05:53-05:00"], "type": ["text"], "subject": ["Digital Preservation Project", "Digital Repositories", "Implementation"], "creator": ["Caballos, Almudena", "Knowles, Chris", "Cawthorn, Kate", "Guillermo Martinez, Antonio", "Fuertes, Maria"], "description": ["Usually, the resulting digital preservation project is very different from its conception. \nThe theory defined before starting a digital preservation project serves as a guide for the beginning of the project, but must be flexible enough to be adapted throughout the implementation to fit the real needs of the organization.\nIn this panel, representatives of institutions from different GLAM-UR sectors from different countries will speak from their own experience about the evolution of a digital preservation project from its theoretical conception to its real practical implementation."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121074", "source_url": "https://hdl.handle.net/2142/121074", "pdf_url": "https://www.ideals.illinois.edu/items/128278/bitstreams/428921/data.pdf"}
{"title": ["THE CURRICULAR ASSET WAREHOUSE AT THE UNIVERSITY OF ILLINOIS: A Digital Archive’s Sustainability Case Study"], "date": ["2023", "2023-11-01T17:09:55-05:00"], "type": ["text"], "subject": ["Media Asset Management", "Sustainability", "Electronic Waste"], "creator": ["Hodgin Jones, Karin", "Jones,  Jimi", "Bianconi, Robyn", "Moran, Liam"], "description": ["What happens to the devices that host digital objects – hard drives, monitors, computer peripherals, storage media – when it is time to upgrade digital preservation environments and workflows? Each step of the production and stewardship of digital objects requires devices and software that have short life cycles and multiple drivers of ever faster obsolescence. These devices flow out of digital repositories and contribute to the fastest growing waste stream of the 21st century: electronic waste or “e-waste.“\nThe Center for Innovation in Teaching and Learning (CITL) at the University of Illinois at Urbana-Champaign is currently working with the head of the university’s Sustainable Design program to perform a case study of the sustainable management of its large volumes of digital video and image content production and preservation, within an analysis of its institutional purchasing and waste management paradigms. The purpose of this analysis is to determine how device obsolescence at CITL can be mitigated to avoid future costs and to minimize the department’s contribution to the global e-waste problem."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121075", "source_url": "https://hdl.handle.net/2142/121075", "pdf_url": "https://www.ideals.illinois.edu/items/128279/bitstreams/428923/data.pdf"}
{"creator": ["Wang, Hannah", "Farrell, Jess", "Mumma, Courtney", "Schaefer, Sibyl"], "date": ["2023-11-01T17:15:11-05:00", "2023"], "description": ["Operating from a foundation of shared values, the community-supported digital preservation services represented in the Digital Preservation Services Collaborative (DPSC) empower stewards of digital content to make informed decisions by offering transparency and accountability. These values have become increasingly important as resources for digital preservation fail to meet the needs of organizations, forcing many mission-critical digital preservation activities to be outsourced to commercial providers. In the DPSC Planning Project, this group of mission-aligned service providers are working to establish closer and more intentional collaboration between their organizations, in order to guarantee the continued availability of services that prioritize transparency and accountability to the cultural heritage organizations they serve. In this interactive panel, partners from the DPSC Planning Project will discuss the importance of the shared values for digital preservation good practice, how they have enacted these values within their organizations, and other project findings."], "language": ["en"], "relation": ["Presentation: https://hdl.handle.net/2142/121675", "iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Digital preservation", "collaboration", "values", "transparency", "accountability"], "title": ["FROM COMMUNITY-SUPPORTED VALUES TO ACTION: Operationalizing the Digital Preservation Declaration of Shared Values"], "type": ["text"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121076", "source_url": "https://hdl.handle.net/2142/121076", "pdf_url": "https://www.ideals.illinois.edu/items/128280/bitstreams/428925/data.pdf"}
{"title": ["LESSONS FROM THE FUTURE: Looking Back on Policy Development"], "date": ["2023", "2023-11-01T17:19:41-05:00"], "type": ["text"], "subject": ["policy", "outreach", "documentation", "advocacy"], "creator": ["England, Elizabeth", "Gengenbach, Martin", "McMeekin, Sharon", "Mitcham, Jenny", "O’Leary, Kieran"], "description": ["Policy is an important component of a successful digital preservation program. For example, CoreTrustSeal [1] suggests that a policy statement would be appropriate evidence to demonstrate that a repository has an explicit mission to provide access to and preserve digital objects, and the DPC’s Rapid Assessment Model [2] suggests that a digital preservation policy should be in place in order to reach the ‘Basic’ level of the ‘Policy and Strategy’ section. While resources exist [3] to assist organizations in developing their first digital preservation policy, these formative strategic documents are intended to hold relevance beyond their initial publication. This panel session highlighted challenges and opportunities in the development and ongoing maintenance of digital preservation policies across three organizations: U.S. National Archives and Records Administration, National Library of Ireland, and National Library of New Zealand. Panelists reflected on learnings from different stages of the policy lifecycle, including initial development, initiating revisions, and re-engaging with dormant policy documents. These efforts are contextualized within broader policy education resources, including the DPC’s revised Digital Preservation Policy Toolkit [4]."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121077", "source_url": "https://hdl.handle.net/2142/121077", "pdf_url": "https://www.ideals.illinois.edu/items/128281/bitstreams/428927/data.pdf"}
{"title": ["TIPPING POINT: Have we gone past the point where we can handle the Digital Preservation Deluge?"], "date": ["2023", "2023-11-01T17:23:23-05:00"], "type": ["text"], "subject": ["Data doomsday", "Tipping point", "Data deluge"], "creator": ["Stokes, Paul", "Colbron, Karen"], "description": ["The world today is faced with an insurmountable problem. There is too much digital “stuff” in existence for us to even handle in any sort of meaningful way, let alone curate and preserve. We have reached (or perhaps even gone beyond) the data processing tipping point. There is an enormous amount of data already in existence and unimaginably more being generated every day. This panel proposal (and accompanying poster) is intended to explore this doomsday data scenario with a group of experts in the field of Digital Preservation and related disciplines with a view to deciding if it is true and what can be done about it."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121078", "source_url": "https://hdl.handle.net/2142/121078", "pdf_url": "https://www.ideals.illinois.edu/items/128282/bitstreams/428929/data.pdf"}
{"description": ["This panel will explore provenance: as theory and practice; as a tool for sustainability; and as a space of shared struggle and challenge for digital preservations and those in fields ranging from archives to cluster computing. In digital preservation, provenance tells us where an object has come from, the myriad preservation actions we could take to care for it, and where we predict the object will need to go in future. This panel is intended for anyone who is interested in the world of provenance: defining it, understanding it, modeling it, addressing the vague dissatisfaction practitioners often have when researching and documenting it. Provenance is more about the journey than the destination: this panel aims to surface a variety of experiences with provenance and to facilitate discussion and a community of practice around the relationship between digital preservation and provenance."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "title": ["RETROSPECTIVE, SUBJUNCTIVE, PROSPECTIVE: PROVENANCE CHALLENGES ACROSS TIME"], "date": ["2023", "2023-11-01T17:27:24-05:00"], "type": ["text"], "subject": ["provenance", "authenticity", "evidence", "archival values", "information theory"], "creator": ["Bettivia, Rhiannon", "Cheng, Yi-Yun", "Gryk, Michael R."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121079", "source_url": "https://hdl.handle.net/2142/121079", "pdf_url": "https://www.ideals.illinois.edu/items/128283/bitstreams/428931/data.pdf"}
{"creator": ["Lischer-Katz, Zack", "Braggs, Rashida K.", "Carter, Bryan", "Bliedung von der Heide, Sven"], "date": ["2023-11-01T17:32:18-05:00", "2023"], "description": ["This panel explores the possibilities and challenges of volumetric video capture for digital humanities research and pedagogy, particularly in terms of documenting and representing the stories of BIPOC Americans who have lived through historical eras of global conflict. The panel will focus on the panelists’ experiences working with volumetric video and their work on a multi-institutional National Endowment for the Humanities-funded project. Panelists will offer perspectives on the benefits of volumetric video and its preservation challenges."], "language": ["en"], "relation": ["iPRES 2023", "Presentation: https://hdl.handle.net/2142/121686"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["volumetric video", "immersive media", "digital storytelling", "inclusion", "preservation"], "title": ["VOLUMETRIC VIDEO FOR PRESERVATION: Exploring the Possibilities and Challenges for Immersive BIPOC Storytelling"], "type": ["text"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121080", "source_url": "https://hdl.handle.net/2142/121080", "pdf_url": "https://www.ideals.illinois.edu/items/128284/bitstreams/428933/data.pdf"}
{"title": ["COMMUNITY IS WE: Modeling collective action as a framework for digital preservation"], "date": ["2023", "2023-11-01T17:37:07-05:00"], "type": ["text"], "subject": ["Best practices", "education", "collaboration", "shared research"], "creator": ["Chassanoff, Alexandra", "Erdman, Stacey", "Farrell, Jess", "Goethals, Andrea", "McMeekin, Sharon", "Narlock, Mikala", "Wang, Hannah"], "description": ["This panel asks the question “how can collective action build global capacity for digital preservation?” Drawing on their own experiences participating in community-driven initiatives, panelists will describe and showcase how collective action efforts have created shared opportunities for advancing digital preservation goals.  Following this discussion, panelists will reflect on the individual challenges and opportunities they faced in participating in such work. The panel will conclude with suggested next steps that can move the field globally towards a shared articulation of digital preservation work in practice."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121081", "source_url": "https://hdl.handle.net/2142/121081", "pdf_url": "https://www.ideals.illinois.edu/items/128285/bitstreams/428935/data.pdf"}
{"date": ["2023-11-01T17:42:00-05:00", "2023"], "title": ["POLICIES, RISKS AND STRATEGIES:  A File Format Debate"], "type": ["text"], "subject": ["File formats", "file format policy", "file format assessment", "preservation planning", "preservation strategy"], "creator": ["Alloing, Sam", "Gilissen, Valentijn", "Johnston, Leslie", "Murray, Kate", "Thorsted, Tyler", "Wheatley, Paul"], "description": ["The digital preservation community has been developing approaches to preserving the meaning of digital content for a number of decades. But questions still remain as to the most accurate, practical, timely and cost effective way of keeping our data usable. Collating and presenting file format policies from several organizations triggered a lively panel discussion in early 2023. This panel session will build on the success and popularity of that debate by bringing in new voices and topics raised by the audience. This subject is a critical one to understand if we are to be successful in preserving our data for future generations."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121082", "source_url": "https://hdl.handle.net/2142/121082", "pdf_url": "https://www.ideals.illinois.edu/items/128286/bitstreams/428937/data.pdf"}
{"title": ["APPROACHES TO DIGITAL PRESERVATION PRODUCT AND SERVICE SUSTAINABILITY: Comparing alternate approaches"], "date": ["2023", "2023-11-01T17:46:44-05:00"], "type": ["text"], "subject": ["Sustainability", "Products", "Services", "Standards"], "creator": ["O’Sullivan, Jack", "Rieger, Oya Y.", "Stewart, Kelly", "Guicherd-Callin, Thib", "Giaretta, David", "Kilbride, William"], "description": ["How do we apply the lessons of ongoing evaluations of digital preservation sustainability within single institutions to the products and services on which this sector increasingly depends? The speakers will look at this key question from different viewpoints to pool best practice and explore the issues to ensure the community can expect more durable systems however they are delivered."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121083", "source_url": "https://hdl.handle.net/2142/121083", "pdf_url": "https://www.ideals.illinois.edu/items/128287/bitstreams/428939/data.pdf"}
{"creator": ["Ville, Marion"], "date": ["2023-11-01T17:57:07-05:00", "2023"], "description": ["Emails are an essential medium of communication. Their management is an organizational, security, legal and financial issue for all organizations.\nThe interdepartmental digital archiving Vitam program, which develops a digital archives management system on behalf of the French government, could not help but wonder about the acquisition, preservation and access to the documents and data contained in email archives. In 2013, it carried out a proof of concept on email archiving, at a time when few archive services in France had embarked on the acquisition of this type of document.\nTen years later, the French landscape in terms of digital recordkeeping has changed significantly. In practice, some archives have put in place strategies for archiving email and tools have been made available to assist in their effort.\nThis article looks at the transition from theory to practice of a more operational acquisition of this type of archive in a French context."], "language": ["en"], "relation": ["iPRES 2023", "Presentation: https://hdl.handle.net/2142/121688"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Email archiving", "Appraisal", "Preserving email", "Tools", "Proof of concept"], "title": ["2013 - 2023: A REVIEW OF TEN YEARS OF EMAIL ARCHIVING IN FRANCE"], "type": ["text"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121084", "source_url": "https://hdl.handle.net/2142/121084", "pdf_url": "https://www.ideals.illinois.edu/items/128288/bitstreams/428941/data.pdf"}
{"title": ["DIGITAL RECORDS CURATION AT THE EAST AND SOUTHERN AFRICAN UNIVERSITIES INSTITUTIONAL REPOSITORIES (IRS)"], "date": ["2023", "2023-11-01T18:01:23-05:00"], "type": ["text"], "subject": ["Botswana", "Kenya", "Universities", "Digital records curation", "Institutional repositories"], "creator": ["Erima, Juliet", "Mosweu , Tshepho L."], "description": ["Most of the knowledge generated in academic institutions today is in digital form. Given that institutional repositories (IRs) across universities receive, preserve and make access to digital assets. The aim of this study is to assess the status of digital curation at Institutional repositories in selected Universities in Botswana and Kenya. The study takes a quantitative approach whereby data was collected through survey questionnaires administered amongst university IR staff in Botswana and Kenya. The data collected was analysed and presented with tables and figures. The Open Archival Information System (OAIS) Functional Model was used in this study as a lens to investigate the problem. The findings of the study show that public universities in Botswana and Kenya have established IRs that ingest digital records into their custody. Most resources ingested include thesis and publications by academic staff and students. These IRs store their digital records on local servers and other storages like CDs. This study found that the majority of the IRs both in Botswana and Kenya do not have digital records preservation plans. This study recommends the use of the OAIS model to preserve, manage and make access to digital records at East and Southern African public Universities Institutional Repositories."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121085", "source_url": "https://hdl.handle.net/2142/121085", "pdf_url": "https://www.ideals.illinois.edu/items/128289/bitstreams/428943/data.pdf"}
{"title": ["REPOSITORY STAFF PERSPECTIVES ON THE BENEFITS OF TRUSTWORTHY DIGITAL REPOSITORY CERTIFICATION"], "date": ["2023", "2023-11-01T18:04:40-05:00"], "type": ["text"], "subject": ["Digital Preservation", "Trustworthy Digital Repositories", "ISO 16363", "TRAC", "Repository Assessment"], "creator": ["Frank, Rebecca D."], "description": ["This paper reports on the results from a qualitative study that asks whether and how staff members from TRAC certified repositories find value in the audit and certification process. While some interviewees found certification valuable, others argued that the costs outweighed the benefits or expressed ambivalence towards certification. Findings indicate that TRAC certification offered both internal and external benefits, such as improved documentation, accountability, transparency, communication, and standards, but there were concerns about high costs, implementation problems, and lack of objective evaluation criteria."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121086", "source_url": "https://hdl.handle.net/2142/121086", "pdf_url": "https://www.ideals.illinois.edu/items/128290/bitstreams/428945/data.pdf"}
{"title": ["A QUESTION OF CHARACTER: How do we automatically recharacterize data at cloud scales?"], "date": ["2023", "2023-11-01T18:09:06-05:00"], "type": ["text"], "subject": ["Scalability", "Automation", "Characterization", "Preservation Actions"], "creator": ["O’Sullivan, Jack", "Clipsham, David", "Soni, Divyesh", "Smith, Richard", "Tilbury, Jonathan"], "description": ["Many preservation actions that we undertake on digital content are driven by the format of the content in question. Format information is often determined at the point of ingest and is not regularly updated as our knowledge of file formats improves over time. Periodically re-characterizing all content in a repository would ensure that we get more accurate identifications over time, but a more sustainable approach would be to only re-characterize content that was actually likely to have changed. Preservica’s new Automated Active Digital Preservation feature seeks to do exactly this, but even when considering only subsets of the data in our cloud systems, we are faced with significant challenges of scale. In this paper, we describe those challenges, the approach we have taken to implement the feature, and the testing we have performed to verify the viability of this approach."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121087", "source_url": "https://hdl.handle.net/2142/121087", "pdf_url": "https://www.ideals.illinois.edu/items/128291/bitstreams/428947/data.pdf"}
{"title": ["BE CAREFUL WHAT YOU CAMPAIGN FOR: How formal organization practice may negatively impact adaptability aspects of preservation"], "date": ["2023", "2023-11-01T18:13:21-05:00"], "type": ["text"], "subject": ["Organizational theory", "learning organization", "adaptability", "stability"], "creator": ["Steinmeier, Daniel"], "description": ["Digital preservationists often struggle using their expert knowledge to create change within their own organization. Because of this, they might need to resort to campaigning for decision-making authority. Why is this? Memory institutions are used to adhering to standards and rules. Rules and regulations are beneficial for stability and trustworthiness. But too much focus on rules may create organizational rigidity which negatively impacts adaptability. Adaptability is a major goal for preservation so how could we create more room for this? An important part of adaptability is organizational learning. In order to facilitate learning we must understand which aspects of organizational practice negatively affect it. For example, avoiding discussion of mistakes is an important barrier to learning. If an organization prioritizes learning this can have a positive impact on the motivation of employees. Practitioners may feel more in control when they understand how to use theories of organizational learning to further implementation of preservation principles. More room for learning within the organization might also benefit the field of preservation itself through enhanced knowledge of what works and what doesn't."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121088", "source_url": "https://hdl.handle.net/2142/121088", "pdf_url": "https://www.ideals.illinois.edu/items/128292/bitstreams/428949/data.pdf"}
{"title": ["NDSA LEVELS OF DIGITAL PRESERVATION: A REVIEW IN TERMS OF TRUSTWORTHINESS OF DIGITAL RECORDS"], "date": ["2023", "2023-11-01T18:17:34-05:00"], "type": ["text"], "subject": ["Digital records", "digital preservation", "trustworthiness"], "creator": ["Sağlık, Özhan"], "description": ["Records created in organizations that have archival value should be preserved for a long time, and to achieve this, digital preservation techniques are used. These techniques also contribute to the preservation of the trustworthiness of the records. In order to assess the situation of organizations in the implementation of their digital preservation activities, there is a need for an analysis tool. Many models have been prepared to meet this need. One is the Levels of Preservation (LoP) developed by the National Digital Stewardship Alliance (NDSA). The LoP provides guidance to organizations in their digital preservation activities. Therefore, it is thought that the LoP can be associated with trustworthiness which aims at long-term preservation of the records. This study examines the levels of digital preservation specified in the LoP in terms of the trustworthiness of digital records. As a result of this research, the goal is to provide the basis for a methodology for organizations wishing to assess their level of digital preservation and to align their digital preservation capabilities with trustworthiness. This study used document analysis as a qualitative research design. Both field observations and research show that organizations are not sufficiently aware of the level of digital preservation and trustworthiness. Then, the question of the study is “how the levels that are specified in the LoP can be associated with the trustworthiness”. As a result of the study, it has been observed that the levels of digital preservation specified in the LoP can be used in the analysis of the trustworthiness of the records. It is expected that this study will raise awareness in the organizations to do a better job of preserving the records that have archival value."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121089", "source_url": "https://hdl.handle.net/2142/121089", "pdf_url": "https://www.ideals.illinois.edu/items/128293/bitstreams/428951/data.pdf"}
{"title": ["IPARO: INTERPLANETARY ARCHIVAL RECORD OBJECT FOR DECENTRALIZED WEB ARCHIVING AND REPLAY"], "date": ["2023", "2023-11-01T18:21:19-05:00"], "type": ["text"], "subject": ["IPARO", "IPFS", "Decentralized Web", "DWeb", "Web Archiving"], "creator": ["Alam, Sawood"], "description": ["We proposed a decentralized version tracking system using the existing primitives of IPFS and IPNS. While our description talks primarily about archived web pages, we proposed the concept of IPMT and namespacing so that it can be used in other applications that require versioning, such as a wiki or a collaborative code tracking system. Our proposed system does not rely on any centralized server for archiving or replay of the content. The system continues to allow aggregators to play their role from which both large and small archives can benefit and flourish."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121090", "source_url": "https://hdl.handle.net/2142/121090", "pdf_url": "https://www.ideals.illinois.edu/items/128294/bitstreams/428953/data.pdf"}
{"title": ["CONTENT-BASED CHARACTERIZATION OF THE END OF TERM WEB ARCHIVE"], "date": ["2023", "2023-11-01T18:45:16-05:00"], "type": ["text"], "subject": ["web archives", "End of Term Web Archive", "WARC Metadata Sidecar"], "creator": ["Phillips, Mark E.", "Phillips, Kristy K.", "Alam, Sawood"], "description": ["Since 2008, the End of Term Web Archive has been gathering snapshots of the federal web, consisting of the publicly accessible .gov and .mil websites. In 2022, the End of Term team began to package these crawls into a public dataset which they released as part of the Amazon Open Data Partnership program. In total, over 460TB of WARC data was moved from local repositories at the Internet Archive and the University of North Texas Libraries. From the original WARC content, derivative datasets were created that address common use cases for web archives. These derivatives include WAT, WET, CDX and a format called a WARC Metadata Sidecar. This WARC Metadata Sidecar includes content-based characterizations of ﬁles held in the archive, including character set, language, ﬁle format identiﬁer, and soft 404 detection. This paper describes the decisions made in the creation of these derivatives, the technologies used, and introduces the WARC Metadata Sidecar, which presents a useful approach for creating and storing auxiliary metadata for web archives."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121091", "source_url": "https://hdl.handle.net/2142/121091", "pdf_url": "https://www.ideals.illinois.edu/items/128295/bitstreams/428955/data.pdf"}
{"title": ["NOT WELL-FORMED OR INVALID. NOW WHAT?: Towards a formalized workflow for format validation error treatment"], "date": ["2023", "2023-11-01T18:48:49-05:00"], "type": ["text"], "subject": ["file format validation", "process formalization", "error handling"], "creator": ["Lindlar, Micky"], "description": ["File format validation – we all use it and we all run into problems when files do not validate. Though a core process within digital preservation practice, little progress has been made in shared documentation and discussion of processes used to treat file format validation errors. This paper aims to close that gap. A basic workflow for handling validation errors is proposed and visualized, and in a second step tested against two TIFF and two PDF validation errors of varying severity. Observations made are fed back into the workflow diagram. The outcome shall provide a first step towards shared digital preservation practice in the currently largely neglected field of method formalization for file format validation error treatment."], "language": ["en"], "relation": ["IPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121092", "source_url": "https://hdl.handle.net/2142/121092", "pdf_url": "https://www.ideals.illinois.edu/items/128296/bitstreams/428957/data.pdf"}
{"title": ["Long-Term Preservation of a Software Execution State"], "date": ["2023", "2023-11-01T18:53:19-05:00"], "type": ["text"], "subject": ["Emulation", "Program Snapshots"], "creator": ["Gieschke, Rafael", "Rechert, Klaus", "Cochrane, Euan"], "description": ["Software is a very complex product, offering an endless number of different states and appearances. To foster academic discussion about software-based cultural and scientific phenomena like computer games, digital art, or scientific computational models, it is necessary to be able to reference specific moments of running software. In this article, we discuss the possibilities to “freeze” software while being executed and describe constraints for the long-term preservation of these snapshots."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121093", "source_url": "https://hdl.handle.net/2142/121093", "pdf_url": "https://www.ideals.illinois.edu/items/128297/bitstreams/428959/data.pdf"}
{"title": ["RETHINKING DIGITAL PRESERVATION: Conceptual Foundations"], "date": ["2023", "2023-11-01T18:56:59-05:00"], "type": ["text"], "subject": ["abductive inference", "abstract reference model", "communicology", "finite state machine", "information experience"], "creator": ["Abrams, Stephen"], "description": ["In support of a multi-year initiative to revitalize its core digital preservation infrastructure, the Harvard Library is engaged in an open-ended exploration of an ideal system solution.  The individual components of that ideal cohere into abstract functional and informational reference models, which act as aspirational  benchmarks for requirements and subsequent procurement and deployment activities.  The models are  derived through the logical refinement of a small set of high-level axiomatic principles.  These reflect a conceptualization of digital preservation as an inherently communicative enterprise with an ultimate goal of complementing the persistence of authentic digital information objects with that of opportunities for legitimate information experiences."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s).  The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121094", "source_url": "https://hdl.handle.net/2142/121094", "pdf_url": "https://www.ideals.illinois.edu/items/128298/bitstreams/428961/data.pdf"}
{"title": ["AROUND FOR DECADES, GONE IN A FLASH: How we dealt with Flash objects at the National Archives of the Netherlands"], "date": ["2023", "2023-11-01T19:01:13-05:00"], "type": ["text"], "subject": ["Flash", "Emulation", "Migration"], "creator": ["van Veenendaal, Remco", "Wijsman, Lotte", "Takema, Jacob", "Rappard, Marin"], "description": ["In 2020, Adobe announced that they would end support for Adobe Flash Player. Initially, we (the preservation team at the National Archives of the Netherlands) assumed we had only a few or no Flash objects in our digital repository, but this assumption turned out to be incorrect. The discovery of Flash objects in our holding led to the start of a research project to answer several questions. Through a series of dedicated meetings, we formulated a strategy focused on preserving ongoing accessibility to our Flash objects through emulation. We were curious to find out if we had Flash objects, where they were located, and which solution would help us render these objects. This was done with the use of the three preservation functions (Watch, Action, and Planning).  After locating the Flash objects, we were able to test potential solutions. The results were then applied to our situation at the National Archives. This led to the development of conclusions and several pieces of advice accompanying those."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121095", "source_url": "https://hdl.handle.net/2142/121095", "pdf_url": "https://www.ideals.illinois.edu/items/128299/bitstreams/428963/data.pdf"}
{"title": ["SOFTWARE PRESERVATION AFTER THE INTERNET"], "date": ["2023", "2023-11-01T19:04:56-05:00"], "type": ["text"], "subject": ["software preservation", "knowledge management"], "creator": ["Espenschied, Dragan", "Rechert, Klaus"], "description": ["Software preservation must consider knowledge management as a key challenge. We suggest a concep-tualization of software preservation approaches that are available at different stages of the software lifecycle and can support memory institutions to assess the current state of software items in their collection, the capabilities of their infrastructure, and completeness and applicability of knowledge that is required to successfully steward the collec-tion."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121096", "source_url": "https://hdl.handle.net/2142/121096", "pdf_url": "https://www.ideals.illinois.edu/items/128300/bitstreams/428965/data.pdf"}
{"title": ["PUBLISHING AGRICULTURAL DATA FROM THE MORROW PLOTS:  The Value and Logistics of Preserving a Long-Term Research Experiment"], "date": ["2023", "2023-11-01T19:10:17-05:00"], "type": ["text"], "subject": ["data", "agriculture", "archives", "curation", "collaboration"], "creator": ["Anderson, Bethany G.", "Caldrone, Sandi L.", "Henry, Joshua K.", "Imker, Heidi J.", "Margenot, Andrew J.", "Williams, Sarah C."], "description": ["The Morrow Plots at the University of Illinois Urbana-Champaign are the longest-running continuous experimental agricultural fields in the Americas. At iPres 2022 we reported on work to curate, preserve, and visualize planting, treatment, and yield data collected from the plots' nearly 150-year history. This paper provides an update on these efforts over the past year and, with special emphasis on the data’s scientific and cultural value,  discusses the importance of collaborative and interdisciplinary work within the Morrow Plots stakeholder community to publish the dataset, and identify necessary next steps."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121097", "source_url": "https://hdl.handle.net/2142/121097", "pdf_url": "https://www.ideals.illinois.edu/items/128301/bitstreams/428967/data.pdf"}
{"title": ["DIGITAL PRESERVATION AND ACCESSIBILITY OF ARCHIVES IN OMAN:  Current Status and Future Directions"], "date": ["2023", "2023-11-01T19:14:26-05:00"], "type": ["text"], "subject": ["Digital preservation", "Oman", "Institutional archives", "Information management", "Accessibility"], "creator": ["Shehata, Ahmed Maher Khafaga", "Mkadmi, Abderrazak"], "description": ["Digital preservation significance is widely recognized and imperative for all institutions. It is a pressing concern for archival specialists who acknowledge its relevance and necessity in contemporary information management practices.\nThe current paper aims to examine the present state of digital preservation and Accessibility of institutional archives in Oman and to ascertain the challenges and prospects in this domain. This research is conducted through a comprehensive analysis of the extant literature and semi-structured interviews with administrative personnel employed in both public and private institutions in Oman. Semi-structured interviews were conducted with ten professionals in governmental organizations, who were chosen based on their expertise and experience in the field, using purposive sampling.\nThe findings showed that interviewees in Omani institutions value digital preservation for many reasons, such as compliance with Omani law on archives, improved organization and security, and ease of document access. However, all institutions have no unified application strategy for digital preservation. The findings revealed many challenges, including technological obsolescence, security risks, big data management, and human resource challenges."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121098", "source_url": "https://hdl.handle.net/2142/121098", "pdf_url": "https://www.ideals.illinois.edu/items/128302/bitstreams/428969/data.pdf"}
{"creator": ["McMeekin, Sharon", "Haunton, Melinda"], "date": ["2023-11-01T19:17:50-05:00", "2023"], "description": ["Over the last three years, The National Archives (UK) and the Digital Preservation Coalition have collaborated on the development of a growing body of training content under the banner of the “Novice to Know-How” learning pathway. The content has proved to be incredibly popular, opening the door to digital preservation training for individuals and organizations that previously had not been able or willing to engage with the topic. This paper will examine the projects motivations, outputs, impact, and future plans."], "language": ["en"], "relation": ["iPRES 2023", "Presentation: https://hdl.handle.net/2142/121683"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Training", "Workforce Development", "Skills", "Collaboration"], "title": ["RUNNING UP THAT HILL: Making Digital Preservation Skills Accessible with Novice to Know-How"], "type": ["text"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121099", "source_url": "https://hdl.handle.net/2142/121099", "pdf_url": "https://www.ideals.illinois.edu/items/128303/bitstreams/428971/data.pdf"}
{"date": ["2023-11-01T19:21:57-05:00", "2023"], "title": ["MULTILINGUAL LABELS FOR DIGITAL PRESERVATION"], "type": ["text"], "subject": ["Wikidata", "Semantic Web", "multilingual data", "knowledge graph subsets"], "creator": ["Thronton, Katherine", "Seals-Nutt, Kenneth"], "description": ["We introduce a technique for ﬁnding multilingual translations for lists of words using technologies of the Semantic Web. We present four subsets of data from Wikidata and Wikipedia as sources of multilingual labels. Our sample dataset consists of seven terms related to digital preservation. We compare the number of labels we can source for these terms from other human languages via SPARQL queries using the Wikidata Query Service. After discussing the composition of each subset, we detail their advantages and disadvantages. Providing multilingual la- bels as additional access points for resources such as on- tologies, vocabularies and user interfaces for applications increases the relevance of these resources to a larger per- centage of the global population. Increasing multilingual access promotes inclusion for a broader range of people, which leads to greater diversity in the digital preservation community."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121100", "source_url": "https://hdl.handle.net/2142/121100", "pdf_url": "https://www.ideals.illinois.edu/items/128304/bitstreams/428973/data.pdf"}
{"title": ["iPRES 2023 Conference Proceedings"], "date": ["2023", "2023-11-02T00:39:21-05:00"], "type": ["text"], "subject": ["iPRES 2023", "conference proceedings"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121102", "source_url": "https://hdl.handle.net/2142/121102", "pdf_url": "https://www.ideals.illinois.edu/items/128305/bitstreams/437836/data.pdf"}
{"title": ["PRESERVING ONLINE JOURNALISTIC CONTENT IN DISRUPTIVE TIMES: The case of collection.news"], "date": ["2023", "2023-11-02T08:22:36-05:00"], "type": ["text"], "subject": ["collection.news", "archives-at-risk", "authoritarianism", "community archives", "Hong Kong"], "creator": ["Lui, Lok Hei"], "description": ["Journalistic content is a crucial part of history, yet its longevity always remains uncertain without proper curation and preservation. This is true in particular when it comes to journalistic content under authoritarian regime contexts, where freedom of the press and information freedom are usually in vain. The article explores the case of collection.news, a community initiative that crawled, disseminated and hosted the journalistic content of Apple Daily, a pro-democracy media outlet that was forcibly shut down by the authority in Hong Kong. By discussing the key events and tools used by collection.news initiative, the three distinctive features of it, namely exigency, decentralization, and anonymity, are highlighted. Finally, suggestions to the digital preservation field for supporting these community initiatives in authoritarian regimes will be given."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121103", "source_url": "https://hdl.handle.net/2142/121103", "pdf_url": "https://www.ideals.illinois.edu/items/128306/bitstreams/428977/data.pdf"}
{"title": ["CALCULATING THE CARBON FOOTPRINT OF DIGITAL PRESERVATION: A Case Study"], "date": ["2023", "2023-11-02T08:28:10-05:00"], "type": ["text"], "subject": ["sustainability", "carbon footprint", "data centers", "hardware manufacturing", "hardware service life"], "creator": ["Tiainen, Mikko", "Lehtonen, Juha", "Helin, Heikki", "Kylander, Johan"], "description": ["Environmental sustainability is becoming an important factor in digital preservation. We have calculated the carbon footprint of our Finnish national digital preservation services, which we provide for cultural heritage and research sectors. We concentrate on the carbon footprint of manufacturing hardware and shipping the equipment to data centers, and the carbon footprint of the hardware service life and employees related to the services. Using data provided to us by the hardware manufacturers and other sources, we show that the majority of the emissions come from manufacturing and shipping of hardware, whereas the emissions created during the service life has a smaller role. As a whole, the annual carbon footprint of the services is smaller than the annual carbon footprint of three average Finns."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121104", "source_url": "https://hdl.handle.net/2142/121104", "pdf_url": "https://www.ideals.illinois.edu/items/128307/bitstreams/428979/data.pdf"}
{"title": ["THE VALORIZATION OF THE TUNISIAN RADIO ARCHIVE IN THE ARTIFICIAL INTELLIGENCE ERA"], "date": ["2023", "2023-11-02T08:32:06-05:00"], "type": ["text"], "subject": ["artificial intelligence", "image", "music", "Audiovisual", "chatbot"], "creator": ["Meddeb, Sami", "Cecchine, Randi"], "description": ["Radio Elyssa's sound archives face challenges in the post-revolution Tunisian context: preserving a large volume of digital content with limited resources while preserving Tunisia's cultural heritage. The Digital Cooperation Association Tunisia and Radio Elyssa are collaborating to test the potential of Artificial Intelligence tools to automate archival tasks.  Before any automation, it is necessary to understand the regulatory procedures for digital archiving: identifying, classifying, migrating, and storing data according to best practices.\nLong-term preservation faces challenges due to limited resources and increasing digitization. The combination of human expertise and AI will enable Radio Elyssa to use AI responsibly to fulfill its mission."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121105", "source_url": "https://hdl.handle.net/2142/121105", "pdf_url": "https://www.ideals.illinois.edu/items/128308/bitstreams/428981/data.pdf"}
{"title": ["FROM SILOS TO COMMUNITY: The Path to a Holistic Digital Preservation Policy"], "date": ["2023", "2023-11-02T08:35:47-05:00"], "type": ["text"], "subject": ["Community of Practice", "Documentation", "Policy", "Preservation Strategy", "Stewardship"], "creator": ["McCann, Laura", "Stephan, Weatherly A."], "description": ["While New York University Libraries has a long history of and commitment to digital collecting and preservation efforts, the institution did not have any policies governing the services and activities of digital preservation prior to 2022. This paper details the creation of a holistic digital preservation policy statement, with contributors from across ten functional units at NYU Libraries. The policy was grounded in the Libraries’ mission and values–including  deep commitments to inclusion, diversity, belonging, equity, and accessibility–and drew on themes crafted by all members of the group to ensure their work was represented in the statement. The success of the policy group was rooted in its intentional formation and processes that acknowledged the distributed nature of digital preservation and emphasized the creation of a community of practice. Further, it laid the foundation for a more complete suite of preservation policies and forward-looking conversations about how to enact ethical and sustainable stewardship in digital collecting, access, and preservation practices."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121106", "source_url": "https://hdl.handle.net/2142/121106", "pdf_url": "https://www.ideals.illinois.edu/items/128309/bitstreams/428983/data.pdf"}
{"title": ["FIND THE MISSING PIECE: Adding Digital Preservation to the NFT Trading Ecosystem"], "date": ["2023", "2023-11-02T08:39:46-05:00"], "type": ["text"], "subject": ["non-fungible tokens (NFTs)", "digital preservation", "metadata standard", "NFT trading", "NFT flaw"], "creator": ["Shan, Pengyin"], "description": ["The NFT (Non-fungible token) market is experiencing explosive growth. While artists, collectors, and crypto enthusiasts are jumping into this ecosystem, traditional collectors have found it more challenging to evaluate asset value in this NFT market than in the established collectible market. This paper navigates the reason for this problem by examining the design of NFT using ERC-721 and ERC-1155 standards, then illustrates that NFT’s infrastructure makes its evaluation more challenging based on its unstable or lacking connection to the underlying digital assets, which makes the evaluation of NFT inconsistent. This paper will propose a revised business model with a workflow to add digital preservation to the NFT trading ecosystem.  The paper suggests adding digital preservation clients to the Ethereum blockchain and building communication with the back-end digital preservation system to guarantee the stability of NFT’s digital assets. In the end, this paper will discuss the benefits of the new business model and workflow, with potential future challenges and opportunities to the revised NFT market."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121107", "source_url": "https://hdl.handle.net/2142/121107", "pdf_url": "https://www.ideals.illinois.edu/items/128310/bitstreams/428985/data.pdf"}
{"creator": ["Yunes, Erin", "Itchuaqiyaq, Cana Uluak", "Long, Kara"], "date": ["2023-11-02T08:44:21-05:00", "2023"], "description": ["Directed by an Inuit-led and serving tribal organization, Aqqaluk Trust, in the frontline hub-community of Kotzebue, Alaska, the Rematriation Project: Restoring and Sharing Inuit Knowledges aims to create capacity for and access to digital archives related to Inuit cultural, tribal, and scientific knowledges and history to assist tribes and communities in developing localized, culturally appropriate approaches and solutions to their needs. In partnership with a team of scholars from Virginia Tech (itself led by an Iñupiaq scholar from Kotzebue)—the goal of this project is to empower Indigenous communities through the lens of Indigenous data and research sovereignty to collect, control, interpret, and benefit from data that originates from their communities. The Rematriation Project operates on a foundation of community-first, community-led decision making that emphasizes Indigenous Data Sovereignty practices. This paper outlines the goals and initiatives of the first phases of the project."], "language": ["en"], "relation": ["iPRES 2023", "Presentation: https://hdl.handle.net/2142/121684"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Community Archives", "Preservation", "Indigenous Data Sovereignty", "Capacity Building", "Equitable Research"], "title": ["THE REMATRIATION PROJECT: Building Capacity for Community Digital Archiving in Northwest Alaska"], "type": ["text"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121108", "source_url": "https://hdl.handle.net/2142/121108", "pdf_url": "https://www.ideals.illinois.edu/items/128311/bitstreams/428987/data.pdf"}
{"title": ["THE LONG AND WINDING ROAD: Implementing an Open-Source Workflow"], "date": ["2023", "2023-11-02T08:47:51-05:00"], "type": ["text"], "subject": ["open-source", "workflow", "software", "analysis"], "creator": ["Williamson, Karyn"], "description": ["This paper will discuss the recent work of the abrdn archive to create and put in place a fully open-source workflow, the barriers faced, and what was learnt from the experience. abrdn plc, an Edinburgh based investment company, is the first financial institution to implement a fully open-source digital preservation workflow. The following text provides an analysis of the work undertaken by the archive thus far, and argues that the least important aspect of implementing an open-source workflow is the software. Our journey has definitely been a long and winding road with many wrong turns, misleading directions, and occasional problems with running out of fuel, but the outcome has been positive and archive colleagues are keen to find out where the road will lead them next."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121109", "source_url": "https://hdl.handle.net/2142/121109", "pdf_url": "https://www.ideals.illinois.edu/items/128312/bitstreams/428989/data.pdf"}
{"title": ["EAASI PRESERVATION OF MOBILE APPLICATIONS: Progress with the long-term preservation of access to mobile applications using the EaaSI platform"], "date": ["2023", "2023-11-02T08:52:41-05:00"], "type": ["text"], "subject": ["emulation", "mobile", "apps", "applications"], "creator": ["Cochrane, Euan", "Oberhauser, Jurek", "Gieschke, Rafael"], "description": ["Mobile devices have revolutionized computing and democratized access to it. The applications we use on our mobile devices play a critical role in shaping our online experiences, our culture, our politics, and our access to information. Mobile applications are also widely used for data gathering and asset management in many domains from scientific research to infrastructure maintenance. With such a wide-reaching impact it is critical that the preservation community is able to maintain access to mobile applications for future generations. In this short paper we outline progress in using the Emulation as a Service Infrastructure (EaaSI) platform to run obsolete versions of the Android operating system in virtualization and emulation in order to maintain access to mobile applications. We also detail the current limitations of virtualizing and emulating mobile devices and provide a list of future challenges to address as we move forwards with ensuring long-term access to this essential part of our history."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121110", "source_url": "https://hdl.handle.net/2142/121110", "pdf_url": "https://www.ideals.illinois.edu/items/128313/bitstreams/428991/data.pdf"}
{"creator": ["Ellis, Taryn"], "date": ["2023-11-02T08:56:15-05:00", "2023"], "description": ["It is not unusual to find at-risk obsolete carriers in archival collections, but these 3½ inch ADFS-formatted floppy disks hold original digital artworks from the late career of a pioneering Australian multimedia artist. The graphics files, created on an Acorn Archimedes in the late 80s and early 90s, had not been seen for more than 25 years, and the difficult process of preserving and providing access to these artworks, and their associated software, highlights the fragility of the material from this era. The case study presented here discusses how the State Library of South Australia combined open-source and community software to automate the extraction and migration of obsolete content from these disks while capturing filesystem and other metadata—and discovered that emulation is not always the simplest solution."], "language": ["en"], "relation": ["iPRES 2023", "Presentation: https://hdl.handle.net/2142/121687"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["automation", "migration", "RISC OS", "born digital", "digital artwork"], "title": ["SAVING STAN: Preserving the Digital Artwork of Joseph Stanislaus Ostoja-Kotkowski"], "type": ["text"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121111", "source_url": "https://hdl.handle.net/2142/121111", "pdf_url": "https://www.ideals.illinois.edu/items/128314/bitstreams/428993/data.pdf"}
{"title": ["PRIORITIZING STORAGE MEDIA  FOR DIGITAL ARCHIVING AND PRESERVATION"], "date": ["2023", "2023-11-02T08:59:53-05:00"], "type": ["text"], "subject": ["digital archiving", "legacy storage media", "prioritization", "selection and appraisal"], "creator": ["Konstantelos, Leo", "Yan, Emma"], "description": ["This paper summarizes our efforts to-date at Archives & Special Collections, University of Glasgow, to develop a methodology and tool for prioritizing archival processing of digital collections stored in physical storage media. We present the sources and process we used to develop the methodology, and outline the functionality of a prototypical tool to generate prioritization scores."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121112", "source_url": "https://hdl.handle.net/2142/121112", "pdf_url": "https://www.ideals.illinois.edu/items/128315/bitstreams/428995/data.pdf"}
{"creator": ["Lake, Sarah", "Richan, John"], "date": ["2023-11-02T09:06:01-05:00", "2023"], "description": ["Student-run papers, journals, and magazines that were previously published in print form are now almost exclusively hosted on digital publishing platforms. How will this shift impact the longevity of student scholarship and institutional memory? This paper will present an ongoing project that aims to archive web-based student publications at Concordia University. We will discuss the rationale behind the project, our initial objectives and scope, and the challenges that we have encountered so far. We will conclude with a discussion of future opportunities for outreach and other envisioned pathways for collaboration."], "language": ["en"], "relation": ["iPRES 2023", "Presentation: https://hdl.handle.net/2142/121685"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["web archiving", "student publications", "university archives", "academic libraries", "Archive-It"], "title": ["TOWARDS PRESERVING WEB-BASED STUDENT PUBLICATIONS AT CONCORDIA UNIVERSITY"], "type": ["text"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121113", "source_url": "https://hdl.handle.net/2142/121113", "pdf_url": "https://www.ideals.illinois.edu/items/128316/bitstreams/428997/data.pdf"}
{"title": ["(HOW) IT WORKS!: A manifesto .. towards establishing a functional software collection at the Vienna museum of science and technology"], "date": ["2023", "2023-11-02T09:09:43-05:00"], "type": ["text"], "subject": ["software collection", "strategy", "manifest", "open source", "embedded community"], "creator": ["Maltar, Nika", "Schilling, Almut"], "description": ["This paper presents the decision making process involved in establishing a software collection at the Vienna Museum of Science and Technology. The museum's collecting activities have been limited to the collection of tangible heritage. The current collection strategy defines the functionality of a museum object solely as its own material manifestation. That is why the museum keeps its physical collection in a “powered-off” state to preserve its integrity and functionality for the future. \nTo integrate a functional software collection into this theoretical frame we are discussing applied terminology and have developed a manifesto to build on a solid theoretical foundation."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121114", "source_url": "https://hdl.handle.net/2142/121114", "pdf_url": "https://www.ideals.illinois.edu/items/128317/bitstreams/428999/data.pdf"}
{"title": ["REVISION-SAFE ARCHIVING AND LICENSE-CONTROLLED ACCESS USING DISTRIBUTED LEDGER TECHNOLOGY"], "date": ["2023", "2023-11-02T09:25:29-05:00"], "type": ["text"], "subject": ["Blockchain", "Distributed Ledger", "Digital Repository", "Electronic Archiving"], "creator": ["Schlarb, Sven", "Karl, Roman", "Vos, Victor-Jan", "Keijzer, Carlijn", "Sanchez Royo, Begoña"], "description": ["This paper describes an approach and a prototype system to make use of Distributed Ledger Technology or, more specifically, Blockchain, to build a trusted digital repository with a transparent and traceable change record for events related to the preservation or action of requesting or granting access to digital information objects. The approach focuses on a notary use case where the information stored in the blockchain serves as a proof of evidence regarding the existence and integrity of digital information objects."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121115", "source_url": "https://hdl.handle.net/2142/121115", "pdf_url": "https://www.ideals.illinois.edu/items/128318/bitstreams/429001/data.pdf"}
{"title": ["VIRTUALIZATION FOR PROCESSING AND ACCESSING DIGITAL ARCHIVES"], "date": ["2023", "2023-11-02T09:33:01-05:00"], "type": ["text"], "subject": ["Containerization", "desktop virtualization", "virtual machine", "special collections", "born-digital archives", "virtual reading room"], "creator": ["Black, Shelly", "Dietz, Brian", "Farrell, Matthew"], "description": ["At a basic level, virtualization [1] is the use of a host computer or server’s resources to run other computing environments. There are many ways in which virtualized computing environments may be deployed and interacted with, including using software to virtualize additional desktops on a local computer (e.g., VirtualBox, Hyper-V Manager, or VMWare) or accessing virtual command line interfaces hosted by a server or computer cluster [2],[3], and emulating old video game systems on contemporary hardware [4]. In this paper we discuss a cross-institutional collaboration on using containerization and desktop virtualization in digital curation at academic special collections libraries."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121116", "source_url": "https://hdl.handle.net/2142/121116", "pdf_url": "https://www.ideals.illinois.edu/items/128319/bitstreams/429003/data.pdf"}
{"title": ["MONITORING FILE FORMAT OBSOLESCENCE IN REPOSITORIES: An applied method"], "date": ["2023", "2023-11-02T09:37:40-05:00"], "type": ["text"], "subject": ["preservation watch", "file formats", "applied research", "file format obsolescence", "Bass diffusion model"], "creator": ["Alloing, Sam"], "description": ["The Dutch Digital Heritage Network (DDHN) wants to improve the monitoring of file format obsolescence. The Preservation Watch group researched on how institutions can monitor the life cycle of file formats in their repositories and how the monitoring could be implemented on a broader scale. Monitoring file format life cycle implies there needs to be a way to measure format obsolescence or helps an institution to identify when a file format is getting obsolete. The applied research identified the needed information and used a known model to search for trends and is applied in widespread areas. The model was compared with a naive method to evaluate the more complex method. This approach was tested in different types of repositories and used different file formats to research the robustness of the approach. This paper will investigate the possibilities and shortcomings of this method and further research that is required."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121117", "source_url": "https://hdl.handle.net/2142/121117", "pdf_url": "https://www.ideals.illinois.edu/items/128320/bitstreams/429005/data.pdf"}
{"title": ["COMMUNITY ARCHIVES AT THE DIGITAL REPOSITORY OF IRELAND"], "date": ["2023", "2023-11-02T09:46:05-05:00"], "type": ["text"], "subject": ["Digital Archives", "Community Archives", "Digital Preservation", "Inclusion", "Membership", "Ireland", "Cultural Heritage data"], "creator": ["Griffith, Lisa", "Long, Kevin"], "description": ["The Community Archive Scheme is a bottom-up method of community engagement that the Digital Repository of Ireland (DRI) uses to work directly with no or low-income groups with digital material to preserve. The DRI's usual depositors are academic, cultural heritage, or public organisations and libraries with a long history of archiving who select material from their own collections for preservation. Through the Community Archive Scheme, we work in a hands-on way to provide digital preservation to a wider range of groups that fall outside of this sphere. The scheme celebrates its fifth anniversary in 2023 and during this period DRI has worked with nine voluntary groups to help preserve material on a variety of topics including the experience of asylum seekers in Ireland, maternal health, built heritage, LGBT rights and activism in Ireland. The types of material that we are working to preserve through this scheme vary from photographs of artists' works such as quilts, audio-visual material such as community documentaries, and documentaries produced for digital radio and social media. This paper will discuss how the scheme evolved, how these organisations have strengthened DRI as an organisation as well as making our community and collections more equitable and diverse, challenges we have encountered, some of the solutions we have developed, where our successes have come from and some of the future developments we are exploring so that we can continue to work with these groups."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121118", "source_url": "https://hdl.handle.net/2142/121118", "pdf_url": "https://www.ideals.illinois.edu/items/128321/bitstreams/429007/data.pdf"}
{"creator": ["Guillermo Martinez, Antonio", "Fuertes, Maria"], "date": ["2023-11-02T09:54:27-05:00", "2023"], "description": ["The ARCHIVER Project has brought together customers, vendors, and infrastructure providers in an outstanding successful public-private collaborative project, which has also been recognized with the Award for Collaboration and Cooperation which celebrates significant collaboration across institutional, professional, sectoral and geographical boundaries at the Digital Preservation Awards 2022. \nThis paper will review, from the perspective of one of the project winners, the success story of the ARCHIVER Project, highlighting the benefits achieved by leveraging the commercial digital preservation solutions for scientific research data through a pre-commercial procurement process, where end users were able to directly influence the expected functionalities in the platform and how they are expected to operate."], "language": ["en"], "relation": ["iPRES 2023", "Presentation: https://hdl.handle.net/2142/121677"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Digital Preservation", "Research and Development", "Collaboration", "public-private"], "title": ["ARCHIVER PROJECT: A SUCCESSFUL PUBLIC-PRIVATE COLLABORATIVE PROJECT"], "type": ["text"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121119", "source_url": "https://hdl.handle.net/2142/121119", "pdf_url": "https://www.ideals.illinois.edu/items/128322/bitstreams/429009/data.pdf"}
{"title": ["DOCUMENTATION GOOD PRACTICE: Bringing Order in Disruptive Times"], "date": ["2023", "2023-11-02T09:57:33-05:00"], "type": ["text"], "subject": ["Documentation", "Good practice", "Guidance", "Collaboration"], "creator": ["Mitcham, Jenny"], "description": ["In times of disruption we need to do the less interesting parts of our job better than ever. Documentation falls into this category - a sometimes neglected task that is often sidelined in favor of new and exciting innovations or even just the constant pressure of other routine tasks. It is easy to forget to create documentation or to let existing documents stagnate and become out-of-date. And yet, in the event of a disaster, it may be the very first thing we will turn to, to help to bring order to the chaos. When faced with lockdown as a result of the Covid-19 pandemic in early 2020, there is some evidence that digital preservation practitioners turned to maintenance tasks like documentation when working from home [1]. Digital preservation documentation is undoubtedly important to us in the digital preservation community but where is the good practice guidance that tells us what to document, when, where and how? This paper describes work at the Digital Preservation Coalition to gather together community experiences to create a new good practice guide on digital preservation documentation."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121120", "source_url": "https://hdl.handle.net/2142/121120", "pdf_url": "https://www.ideals.illinois.edu/items/128323/bitstreams/429011/data.pdf"}
{"title": ["RESCUING LEGACY DIGITAL COLLECTIONS: Lessons Learned from Migrating Historical Bespoke Digital Collections"], "date": ["2023", "2023-11-02T10:36:22-05:00"], "type": ["text"], "subject": ["Digital humanities", "Legacy digital content", "Data curation", "Sustainability", "Digital preservation"], "creator": ["Maloney, Kayla", "McAlpine, Katrina", "Stanton, Jennifer"], "description": ["The University of Sydney Library hosts many historically significant digital collections. In 2021 and 2022, the Library undertook a project to ensure the accessibility of these collections, migrating them from ageing web servers to our current repository systems. This paper outlines the challenges involved in managing bespoke legacy collections at an institution in the early stages of building digital preservation capacity. We discuss the approaches taken to make use of existing systems, capabilities, and resourcing to rescue collections and prepare for future preservation actions."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121121", "source_url": "https://hdl.handle.net/2142/121121", "pdf_url": "https://www.ideals.illinois.edu/items/128324/bitstreams/429013/data.pdf"}
{"title": ["QUALITY PRESERVATION: Emerging Quality Assurance Practices in the Library of Congress Web Archives"], "date": ["2023", "2023-11-02T10:40:08-05:00"], "type": ["text"], "subject": ["Web Archives", "Quality Assurance", "Workflows", "Human-centered digital practitioners"], "creator": ["Lyon, Meghan", "Bicho, Grace"], "description": ["Building sustainable quality assurance practices is a challenge for today's preservationists, who want to be sure that content preserved in web archives is not only the correct content, but in working order. This often means that archived web content should be replayed via Wayback rendering software in good fidelity when compared to the original website. The exponentially growing scale of web archives necessitates a multipronged approach to identify what is (and is not) being preserved, and where improvements can be made. This paper will explore actions that can take place iteratively throughout the web archiving life cycle, as part of a larger system of review where multiple individuals can contribute, including non-technical Library staff and subject matter experts. The processes described are part of a novel workflow in the Library of Congress Web Archiving Program."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121122", "source_url": "https://hdl.handle.net/2142/121122", "pdf_url": "https://www.ideals.illinois.edu/items/128325/bitstreams/429015/data.pdf"}
{"title": ["A STORAGE AND SEARCH DEMONSTRATION WITH DNA-ENCODED TEXT"], "date": ["2023", "2023-11-02T10:43:38-05:00"], "type": ["text"], "subject": ["DNA", "sustainability", "storage", "search"], "creator": ["Provencher, Laurel", "Bhatia, Swapnil", "Mihm, Sean"], "description": ["DNA-based data storage (DDS) holds promise to deliver a paradigm shift for long-term, secure storage of data. To tap into this potential, methods must be developed to produce data-encoding DNA molecules with cost- and time-effective processes.  Combinatorial synthesis of DNA molecules from prefabricated fragments of DNA offers a solution to this challenge.  We are developing a DNA-based platform combining encoding algorithms, high-throughput synthesis, post-synthesis processing, sequencing, decoding algorithms, and DNA computing architectures into a unified system.  DNA datasets encoding images and literary works have been successfully created and translated back into conventional data files containing the entire original set of data or a targeted subset of data.  In this work, we demonstrate the ability to search for specific molecules encoding a specific word in a DNA dataset encoding the complete text of multiple literary works."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121123", "source_url": "https://hdl.handle.net/2142/121123", "pdf_url": "https://www.ideals.illinois.edu/items/128326/bitstreams/429017/data.pdf"}
{"title": ["PDF/MAIL: Moving Theory Towards Practice"], "date": ["2023", "2023-11-02T10:47:48-05:00"], "type": ["text"], "subject": ["Email", "File Format", "Specification Development", "Software", "Metadata"], "creator": ["Habing, Tom", "Wyatt, Peter", "Irwin, Eden", "Martinez, Ruby", "Johnson, Duff", "Prom, Christopher"], "description": ["Email is one of the most ubiquitous forms of communication in both personal and professional contexts. The EA-PDF (Email Archiving with PDF) project is developing a PDF specification (PDF/mail) for email archiving, as well as an open-source tool to convert emails to the new PDF format. By creating a new specification defining common understandings for archiving email, the project aims for PDF/mail to lower barriers to effective email preservation that meets the needs of the archive and digital preservation community.  This includes building a community to support the project, developing the PDF specification itself, and creating a proof-of-concept tool to convert emails to PDF. With an open-source tool available for converting emails, archivists and other professionals—particularly those working in context where they do not have access to technologies supporting email preservation--will have a straightforward and cost-effective way of preserving emails for posterity, complementing other preservation methods and tools."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121124", "source_url": "https://hdl.handle.net/2142/121124", "pdf_url": "https://www.ideals.illinois.edu/items/128327/bitstreams/429019/data.pdf"}
{"title": ["CREATING AN END-TO-END PROCESS FOR IMPLEMENTING A DIGITAL ARCHIVING WORKFLOW:  How we are putting theory into practice"], "date": ["2023", "2023-11-02T10:50:54-05:00"], "type": ["text"], "subject": ["Digital archiving", "workflows", "case study"], "creator": ["Konstantelos, Leo", "Yan, Emma"], "description": ["This paper presents the efforts of Archives and Special Collections (ASC) at the University of Glasgow to produce an end-to-end process for implementing our digital archiving workflow.  This will be achieved by conducting a pilot project and in this paper we discuss the project, our methodology and outputs and outcomes."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121125", "source_url": "https://hdl.handle.net/2142/121125", "pdf_url": "https://www.ideals.illinois.edu/items/128328/bitstreams/429021/data.pdf"}
{"title": ["I GOT A LETTER FROM MY PAST SELF: (Un)managed Change and Provenance"], "date": ["2023", "2023-11-02T10:56:08-05:00"], "type": ["text"], "subject": ["provenance", "managed change", "identity", "temporality"], "creator": ["Bettivia, Rhiannon", "Cheng, Yi-Yun", "Gryk, Michael R."], "description": ["Significant properties (sigProps) research often focuses on the preservation targets. Yet research consistently shows that what is significant about an object is not necessarily inherent to objects. Simultaneously, sigProps research does not adequately attend to temporality. Time is built into the concept of sigProps: they are about what ideally should not change over time. This paper centers temporality in relation to sigProps to explore challenging case studies."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121126", "source_url": "https://hdl.handle.net/2142/121126", "pdf_url": "https://www.ideals.illinois.edu/items/128329/bitstreams/429023/data.pdf"}
{"title": ["KEY ELEMENTS OF A FILE FORMAT STRATEGY: The only bad file format is one that hasn't been documented."], "date": ["2023", "2023-11-02T11:06:47-05:00"], "type": ["text"], "subject": ["File Formats", "Documentation", "Registry"], "creator": ["Thorsted, Tyler"], "description": ["Within the Digital Preservation Community there are many references to policies on file formats, acceptable file formats, preservation policies and strategies, risk matrices, and action plans. All have the intention of defining and describing file formats and guiding decisions on which formats to preserve how, and when. My team and I originally created a File Format Action Plan, which was later migrated from OneNote to Confluence and then included more strategic plans for hundreds of file formats. This paper explores which key elements should be included in an effective file format strategy and the different ways such data can be used by people and systems. What works for one institution may not work for another, and the work created by a larger institution may benefit those with smaller resources."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121127", "source_url": "https://hdl.handle.net/2142/121127", "pdf_url": "https://www.ideals.illinois.edu/items/128330/bitstreams/429025/data.pdf"}
{"title": ["NOTIONS OF VALUE IN DIGITAL OBJECTS: A debate with myself and others"], "date": ["2023", "2023-11-02T11:09:25-05:00"], "type": ["text"], "subject": ["Appraisal", "value", "cost"], "creator": ["Popham, Michael"], "description": ["The world of digital preservation and archiving has drawn heavily on the thinking of our analogue predecessors. When it comes to selecting materials, we are familiar with the idea of appraisal: “the process of determining whether records and other materials have permanent (archival) value” [1]. Typically, the notion of “value” is then further refined into broad sub-genres, such as evidential, informational, intrinsic, contextual, and so forth [2]. At iPres 2022, a panel session and related poster examined the problem of “The Value of Catastrophic Data Loss” but the debate repeatedly returned to measuring this value purely in terms of economic costs. This paper unpicks the notion of value further, and offers some reflections on how these ideas might apply to digital materials and be predicated on the essential differences between analog and digital sources."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121128", "source_url": "https://hdl.handle.net/2142/121128", "pdf_url": "https://www.ideals.illinois.edu/items/128331/bitstreams/429027/data.pdf"}
{"title": ["EVOLUTION OF BORN-DIGITAL MOVING IMAGE PROCESSING: Moving to scalable and sustainable workflows"], "date": ["2023", "2023-11-02T11:23:45-05:00"], "type": ["text"], "subject": ["moving image", "digital workflows", "scalability", "technical infrastructure", "digital preservation"], "creator": ["Curtis, Rachel", "Drake Davis, Laura"], "description": ["Long-term preservation of born-digital moving image content is similar to that of any other file-based content in many ways. However, large file sizes, specialized equipment and resources, significant processing storage needs, and the movement of large files are challenges to creating sustainable and scalable workflows. The Moving Image Section of the National Audio Visual Conservation Center at the Library of Congress is making great strides in the development of sustainable and scalable workflows through an understanding of the technical infrastructure, moving image file characteristics and requirements, and the adoption of automated workflows using a combination of open source software and hardware resources."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121129", "source_url": "https://hdl.handle.net/2142/121129", "pdf_url": "https://www.ideals.illinois.edu/items/128332/bitstreams/429029/data.pdf"}
{"title": ["TACIT PROCESSES: Qualitative Analysis Toward Bottom-Up Emulation Workflows"], "date": ["2023", "2023-11-02T11:28:31-05:00"], "type": ["text"], "subject": ["Emulation", "Digital Preservation", "Qualitative Analysis", "Grounded Theory"], "creator": ["Kaltman, Eric", "Larson, Adam"], "description": ["This paper describes the use of a modification of qualitative grounded theory to analyze in-situ preservation workflows involving emulation techniques. The goal of this in-process work is to identify and delineate common tasks across the emulation of different classes of software objects through a unique approach based in bottom-up qualitative observation."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this paper is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121130", "source_url": "https://hdl.handle.net/2142/121130", "pdf_url": "https://www.ideals.illinois.edu/items/128333/bitstreams/429031/data.pdf"}
{"title": ["POLICIES, RISKS AND STRATEGIES: A File Format Debate [presentation]"], "date": ["2023", "2023-12-19T14:09:06-06:00"], "type": ["Presentation"], "subject": ["File formats", "file format policy", "file format assessment", "preservation planning", "preservation strategy"], "creator": ["Alloing, Sam", "Gilissen, Valentijn", "Johnston, Leslie", "Murray, Kate", "Thorsted, Tyler", "Wheatley, Paul"], "description": ["The digital preservation community has been developing approaches to preserving the meaning of digital content for a number of decades. But questions still remain as to the most accurate, practical, timely and cost effective way of keeping our data usable. Collating and presenting file format policies from several organizations triggered a lively panel discussion in early 2023. This panel session will build on the success and popularity of that debate by bringing in new voices and topics raised by the audience. This subject is a critical one to understand if we are to be successful in preserving our data for future generations."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121593", "source_url": "https://hdl.handle.net/2142/121593", "pdf_url": "https://www.ideals.illinois.edu/items/128787/bitstreams/430167/data.pdf"}
{"title": ["AROUND FOR DECADES, GONE IN A FLASH: How we dealt with Flash objects at the National Archives of the Netherlands [presentation]"], "date": ["2023", "2023-12-19T14:24:59-06:00"], "type": ["Presentation"], "subject": ["Flash", "Emulation", "Migration"], "creator": ["Rappard, Marin", "Wijsman, Lotte"], "description": ["In 2020, Adobe announced that they would end support for Adobe Flash Player. Initially, we (the preservation team at the National Archives of the Netherlands) assumed we had only a few or no Flash objects in our digital repository, but this assumption turned out to be incorrect. The discovery of Flash objects in our holding led to the start of a research project to answer several questions. Through a series of dedicated meetings, we formulated a strategy focused on preserving ongoing accessibility to our Flash objects through emulation. We were curious to find out if we had Flash objects, where they were located, and which solution would help us render these objects. This was done with the use of the three preservation functions (Watch, Action, and Planning). After locating the Flash objects, we were able to test potential solutions. The results were then applied to our situation at the National Archives. This led to the development of conclusions and several pieces of advice accompanying those."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121595", "source_url": "https://hdl.handle.net/2142/121595", "pdf_url": "https://www.ideals.illinois.edu/items/128789/bitstreams/430170/data.pdf"}
{"date": ["2023-12-19T14:35:59-06:00", "2023"], "title": ["DOCUMENTATION GOOD PRACTICE: Bringing Order in Disruptive Times [presentation]"], "type": ["Presentation"], "subject": ["Documentation", "Good practice", "Guidance", "Collaboration"], "creator": ["Mitcham, Jenny"], "description": ["In times of disruption we need to do the less interesting parts of our job better than ever. Documentation falls into this category - a sometimes neglected task that is often sidelined in favor of new and exciting innovations or even just the constant pressure of other routine tasks. It is easy to forget to create documentation or to let existing documents stagnate and become out-of-date. And yet, in the event of a disaster, it may be the very first thing we will turn to, to help to bring order to the chaos. When faced with lockdown as a result of the Covid-19 pandemic in early 2020, there is some evidence that digital preservation practitioners turned to maintenance tasks like documentation when working from home [1]. Digital preservation documentation is undoubtedly important to us in the digital preservation community but where is the good practice guidance that tells us what to document, when, where and how? This paper describes work at the Digital Preservation Coalition to gather together community experiences to create a new good practice guide on digital preservation documentation."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121596", "source_url": "https://hdl.handle.net/2142/121596", "pdf_url": "https://www.ideals.illinois.edu/items/128790/bitstreams/430172/data.pdf"}
{"title": ["LESSONS FROM THE FUTURE: Looking Back on Policy Development [presentation]"], "date": ["2023", "2023-12-19T14:43:39-06:00"], "type": ["Presentation"], "subject": ["policy", "outreach", "documentation", "advocacy"], "creator": ["England, Elizabeth", "Gengenbach, Martin", "McMeekin, Sharon", "Mitcham, Jenny", "O’Leary, Kieran"], "description": ["Policy is an important component of a successful digital preservation program. For example, CoreTrustSeal [1] suggests that a policy statement would be appropriate evidence to demonstrate that a repository has an explicit mission to provide access to and preserve digital objects, and the DPC’s Rapid Assessment Model [2] suggests that a digital preservation policy should be in place in order to reach the ‘Basic’ level of the ‘Policy and Strategy’ section. While resources exist [3] to assist organizations in developing their first digital preservation policy, these formative strategic documents are intended to hold relevance beyond their initial publication. This panel session highlighted challenges and opportunities in the development and ongoing maintenance of digital preservation policies across three organizations: U.S. National Archives and Records Administration, National Library of Ireland, and National Library of New Zealand. Panelists reflected on learnings from different stages of the policy lifecycle, including initial development, initiating revisions, and re-engaging with dormant policy documents. These efforts are contextualized within broader policy education resources, including the DPC’s revised Digital Preservation Policy Toolkit [4]."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121597", "source_url": "https://hdl.handle.net/2142/121597", "pdf_url": "https://www.ideals.illinois.edu/items/128791/bitstreams/430174/data.pdf"}
{"title": ["FROM SILOS TO COMMUNITY: The Path to a Holistic Digital Preservation Policy [presentation]"], "date": ["2023", "2023-12-19T14:51:51-06:00"], "type": ["Presentation"], "subject": ["Community of Practice", "Documentation", "Policy", "Preservation Strategy", "Stewardship"], "creator": ["McCann, Laura", "Stephan, Weatherly A."], "description": ["While New York University Libraries has a long history of and commitment to digital collecting and preservation efforts, the institution did not have any policies governing the services and activities of digital preservation prior to 2022. This paper details the creation of a holistic digital preservation policy statement, with contributors from across ten functional units at NYU Libraries. The policy was grounded in the Libraries’ mission and values–including deep commitments to inclusion, diversity, belonging, equity, and accessibility–and drew on themes crafted by all members of the group to ensure their work was represented in the statement. The success of the policy group was rooted in its intentional formation and processes that acknowledged the distributed nature of digital preservation and emphasized the creation of a community of practice. Further, it laid the foundation for a more complete suite of preservation policies and forward-looking conversations about how to enact ethical and sustainable stewardship in digital collecting, access, and preservation practices."], "language": ["en"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121599", "source_url": "https://hdl.handle.net/2142/121599", "pdf_url": "https://www.ideals.illinois.edu/items/128793/bitstreams/430179/data.pdf"}
{"language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "date": ["2023-12-30T12:37:29-06:00", "2023"], "title": ["FIND THE MISSING PIECE: Adding Digital Preservation to the NFT Trading Ecosystem [presentation]"], "type": ["Presentation"], "subject": ["non-fungible tokens (NFTs)", "digital preservation", "metadata standard", "NFT trading", "NFT flaw"], "creator": ["Shan, Pengyin"], "description": ["The NFT (Non-fungible token) market is experiencing explosive growth. While artists, collectors, and crypto enthusiasts are jumping into this ecosystem, traditional collectors have found it more challenging to evaluate asset value in this NFT market than in the established collectible market. This paper navigates the reason for this problem by examining the design of NFT using ERC-721 and ERC-1155 standards, then illustrates that NFT’s infrastructure makes its evaluation more challenging based on its unstable or lacking connection to the underlying digital assets, which makes the evaluation of NFT inconsistent. This paper will propose a revised business model with a workflow to add digital preservation to the NFT trading ecosystem. The paper suggests adding digital preservation clients to the Ethereum blockchain and building communication with the back-end digital preservation system to guarantee the stability of NFT’s digital assets. In the end, this paper will discuss the benefits of the new business model and workflow, with potential future challenges and opportunities to the revised NFT market."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121650", "source_url": "https://hdl.handle.net/2142/121650", "pdf_url": "https://www.ideals.illinois.edu/items/128844/bitstreams/430282/data.pdf"}
{"rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "date": ["2023-12-30T12:42:42-06:00", "2023"], "description": ["Long-term preservation of born-digital moving image content is similar to that of any other file-based content in many ways. However, large file sizes, specialized equipment and resources, significant processing storage needs, and the movement of large files are challenges to creating sustainable and scalable workflows. The Moving Image Section of the National Audio Visual Conservation Center at the Library of Congress is making great strides in the development of sustainable and scalable workflows through an understanding of the technical infrastructure, moving image file characteristics and requirements, and the adoption of automated workflows using a combination of open source software and hardware resources."], "language": ["eng"], "relation": ["iPRES 2023"], "title": ["EVOLUTION OF BORN-DIGITAL MOVING IMAGE PROCESSING: Moving to scalable and sustainable workflows [presentation]"], "type": ["Presentation"], "subject": ["moving image", "digital workflows", "scalability", "technical infrastructure", "digital preservation"], "creator": ["Curtis, Rachel", "Drake Davis, Laura"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121651", "source_url": "https://hdl.handle.net/2142/121651", "pdf_url": "https://www.ideals.illinois.edu/items/128845/bitstreams/430284/data.pdf"}
{"title": ["NDSA LEVELS OF DIGITAL PRESERVATION: A REVIEW IN TERMS OF TRUSTWORTHINESS OF DIGITAL RECORDS [presentation]"], "date": ["2023", "2023-12-30T12:48:26-06:00"], "type": ["Presentation"], "subject": ["Digital records", "digital preservation", "trustworthiness"], "creator": ["Sağlık, Özhan"], "description": ["Records created in organizations that have archival value should be preserved for a long time, and to achieve this, digital preservation techniques are used. These techniques also contribute to the preservation of the trustworthiness of the records. In order to assess the situation of organizations in the implementation of their digital preservation activities, there is a need for an analysis tool. Many models have been prepared to meet this need. One is the Levels of Preservation (LoP) developed by the National Digital Stewardship Alliance (NDSA). The LoP provides guidance to organizations in their digital preservation activities. Therefore, it is thought that the LoP can be associated with trustworthiness which aims at long-term preservation of the records. This study examines the levels of digital preservation specified in the LoP in terms of the trustworthiness of digital records. As a result of this research, the goal is to provide the basis for a methodology for organizations wishing to assess their level of digital preservation and to align their digital preservation capabilities with trustworthiness. This study used document analysis as a qualitative research design. Both field observations and research show that organizations are not sufficiently aware of the level of digital preservation and trustworthiness. Then, the question of the study is “how the levels that are specified in the LoP can be associated with the trustworthiness”. As a result of the study, it has been observed that the levels of digital preservation specified in the LoP can be used in the analysis of the trustworthiness of the records. It is expected that this study will raise awareness in the organizations to do a better job of preserving the records that have archival value."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121652", "source_url": "https://hdl.handle.net/2142/121652", "pdf_url": "https://www.ideals.illinois.edu/items/128846/bitstreams/430286/data.pdf"}
{"title": ["REPOSITORY STAFF PERSPECTIVES ON THE BENEFITS OF TRUSTWORTHY DIGITAL REPOSITORY CERTIFICATION [presentation]"], "date": ["2023", "2023-12-30T12:53:15-06:00"], "type": ["Presentation"], "subject": ["Digital Preservation", "Trustworthy Digital Repositories", "ISO 16363", "TRAC", "Repository Assessment"], "creator": ["Frank, Rebecca D."], "description": ["This paper reports on the results from a qualitative study that asks whether and how staff members from TRAC certified repositories find value in the audit and certification process. While some interviewees found certification valuable, others argued that the costs outweighed the benefits or expressed ambivalence towards certification. Findings indicate that TRAC certification offered both internal and external benefits, such as improved documentation, accountability, transparency, communication, and standards, but there were concerns about high costs, implementation problems, and lack of objective evaluation criteria."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121653", "source_url": "https://hdl.handle.net/2142/121653", "pdf_url": "https://www.ideals.illinois.edu/items/128847/bitstreams/430288/data.pdf"}
{"title": ["RESCUING LEGACY DIGITAL COLLECTIONS: Lessons Learned from Migrating Historical Bespoke Digital Collections [presentation]"], "date": ["2023", "2023-12-30T13:08:03-06:00"], "type": ["Presentation"], "subject": ["Digital humanities", "Legacy digital content", "Data curation", "Sustainability", "Digital preservation"], "creator": ["Maloney, Kayla", "McAlpine, Katrina", "Stanton, Jennifer"], "description": ["The University of Sydney Library hosts many historically significant digital collections. In 2021 and 2022, the Library undertook a project to ensure the accessibility of these collections, migrating them from ageing web servers to our current repository systems. This paper outlines the challenges involved in managing bespoke legacy collections at an institution in the early stages of building digital preservation capacity. We discuss the approaches taken to make use of existing systems, capabilities, and resourcing to rescue collections and prepare for future preservation actions."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121654", "source_url": "https://hdl.handle.net/2142/121654", "pdf_url": "https://www.ideals.illinois.edu/items/128848/bitstreams/430290/data.pdf"}
{"title": ["CALCULATING THE CARBON FOOTPRINT OF DIGITAL PRESERVATION: A Case Study [presentation]"], "date": ["2023", "2023-12-30T13:12:53-06:00"], "type": ["Presentation"], "subject": ["sustainability", "carbon footprint", "data centers", "hardware manufacturing", "hardware service life"], "creator": ["Tiainen, Mikko"], "description": ["Environmental sustainability is becoming an important factor in digital preservation. We have calculated the carbon footprint of our Finnish national digital preservation services, which we provide for cultural heritage and research sectors. We concentrate on the carbon footprint of manufacturing hardware and shipping the equipment to data centers, and the carbon footprint of the hardware service life and employees related to the services. Using data provided to us by the hardware manufacturers and other sources, we show that the majority of the emissions come from manufacturing and shipping of hardware, whereas the emissions created during the service life has a smaller role. As a whole, the annual carbon footprint of the services is smaller than the annual carbon footprint of three average Finns."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121655", "source_url": "https://hdl.handle.net/2142/121655", "pdf_url": "https://www.ideals.illinois.edu/items/128849/bitstreams/430292/data.pdf"}
{"title": ["THE CURRICULAR ASSET WAREHOUSE AT THE UNIVERSITY OF ILLINOIS: A Digital Archive’s Sustainability Case Study [presentation]"], "date": ["2023", "2023-12-30T13:20:22-06:00"], "type": ["Presentation"], "subject": ["Media Asset Management", "Sustainability", "Electronic Waste"], "creator": ["Hodgin Jones, Karin", "Jones, Jimi", "Bianconi, Robyn", "Moran, Liam"], "description": ["What happens to the devices that host digital objects – hard drives, monitors, computer peripherals, storage media – when it is time to upgrade digital preservation environments and workflows? Each step of the production and stewardship of digital objects requires devices and software that have short life cycles and multiple drivers of ever faster obsolescence. These devices flow out of digital repositories and contribute to the fastest growing waste stream of the 21st century: electronic waste or “e-waste.“ The Center for Innovation in Teaching and Learning (CITL) at the University of Illinois at Urbana-Champaign is currently working with the head of the university’s Sustainable Design program to perform a case study of the sustainable management of its large volumes of digital video and image content production and preservation, within an analysis of its institutional purchasing and waste management paradigms. The purpose of this analysis is to determine how device obsolescence at CITL can be mitigated to avoid future costs and to minimize the department’s contribution to the global e-waste problem."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121656", "source_url": "https://hdl.handle.net/2142/121656", "pdf_url": "https://www.ideals.illinois.edu/items/128850/bitstreams/430294/data.pdf"}
{"title": ["MONITORING FILE FORMAT OBSOLESCENCE IN REPOSITORIES: An applied method [presentation]"], "date": ["2023", "2023-12-30T13:25:46-06:00"], "type": ["Presentation"], "subject": ["preservation watch", "file formats", "applied research", "file format obsolescence", "Bass diffusion model"], "creator": ["Alloing, Sam"], "description": ["The Dutch Digital Heritage Network (DDHN) wants to improve the monitoring of file format obsolescence. The Preservation Watch group researched on how institutions can monitor the life cycle of file formats in their repositories and how the monitoring could be implemented on a broader scale. Monitoring file format life cycle implies there needs to be a way to measure format obsolescence or helps an institution to identify when a file format is getting obsolete. The applied research identified the needed information and used a known model to search for trends and is applied in widespread areas. The model was compared with a naive method to evaluate the more complex method. This approach was tested in different types of repositories and used different file formats to research the robustness of the approach. This paper will investigate the possibilities and shortcomings of this method and further research that is required."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121657", "source_url": "https://hdl.handle.net/2142/121657", "pdf_url": "https://www.ideals.illinois.edu/items/128851/bitstreams/430296/data.pdf"}
{"title": ["BE CAREFUL WHAT YOU CAMPAIGN FOR: How formal organization practice may negatively impact adaptability aspects of preservation [presentation]"], "date": ["2023", "2023-12-30T13:44:00-06:00"], "type": ["Presentation"], "subject": ["Organizational theory", "learning organization", "adaptability", "stability"], "creator": ["Steinmeier, Daniel"], "description": ["Digital preservationists often struggle using their expert knowledge to create change within their own organization. Because of this, they might need to resort to campaigning for decision-making authority. Why is this? Memory institutions are used to adhering to standards and rules. Rules and regulations are beneficial for stability and trustworthiness. But too much focus on rules may create organizational rigidity which negatively impacts adaptability. Adaptability is a major goal for preservation so how could we create more room for this? An important part of adaptability is organizational learning. In order to facilitate learning we must understand which aspects of organizational practice negatively affect it. For example, avoiding discussion of mistakes is an important barrier to learning. If an organization prioritizes learning this can have a positive impact on the motivation of employees. Practitioners may feel more in control when they understand how to use theories of organizational learning to further implementation of preservation principles. More room for learning within the organization might also benefit the field of preservation itself through enhanced knowledge of what works and what doesn't."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121658", "source_url": "https://hdl.handle.net/2142/121658", "pdf_url": "https://www.ideals.illinois.edu/items/128852/bitstreams/430298/data.pdf"}
{"title": ["TACIT PROCESSES: Qualitative Analysis Toward Bottom-Up Emulation Workflows [presentation]"], "date": ["2023", "2023-12-30T13:50:54-06:00"], "type": ["Presentation"], "subject": ["Emulation", "Digital Preservation", "Qualitative Analysis", "Grounded Theory"], "creator": ["Kaltman, Eric", "Larson, Adam"], "description": ["This paper describes the use of a modification of qualitative grounded theory to analyze in-situ preservation workflows involving emulation techniques. The goal of this in-process work is to identify and delineate common tasks across the emulation of different classes of software objects through a unique approach based in bottom-up qualitative observation."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121659", "source_url": "https://hdl.handle.net/2142/121659", "pdf_url": "https://www.ideals.illinois.edu/items/128853/bitstreams/430300/data.pdf"}
{"title": ["IPARO: INTERPLANETARY ARCHIVAL RECORD OBJECT FOR DECENTRALIZED WEB ARCHIVING AND REPLAY [presentation]"], "date": ["2023", "2023-12-30T13:55:37-06:00"], "type": ["Presentation"], "subject": ["IPARO", "IPFS", "Decentralized Web", "DWeb", "Web Archiving"], "creator": ["Alam, Sawood"], "description": ["We proposed a decentralized version tracking system using the existing primitives of IPFS and IPNS. While our description talks primarily about archived web pages, we proposed the concept of IPMT and namespacing so that it can be used in other applications that require versioning, such as a wiki or a collaborative code tracking system. Our proposed system does not rely on any centralized server for archiving or replay of the content. The system continues to allow aggregators to play their role from which both large and small archives can benefit and flourish."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121660", "source_url": "https://hdl.handle.net/2142/121660", "pdf_url": "https://www.ideals.illinois.edu/items/128854/bitstreams/430302/data.pdf"}
{"title": ["A STORAGE AND SEARCH DEMONSTRATION WITH DNA-ENCODED TEXT [presentation]"], "date": ["2023", "2023-12-30T14:00:23-06:00"], "type": ["Presentation"], "subject": ["DNA", "sustainability", "storage", "search"], "creator": ["Provencher, Laurel"], "description": ["DNA-based data storage (DDS) holds promise to deliver a paradigm shift for long-term, secure storage of data. To tap into this potential, methods must be developed to produce data-encoding DNA molecules with cost- and time-effective processes. Combinatorial synthesis of DNA molecules from prefabricated fragments of DNA offers a solution to this challenge. We are developing a DNA-based platform combining encoding algorithms, high-throughput synthesis, post-synthesis processing, sequencing, decoding algorithms, and DNA computing architectures into a unified system. DNA datasets encoding images and literary works have been successfully created and translated back into conventional data files containing the entire original set of data or a targeted subset of data. In this work, we demonstrate the ability to search for specific molecules encoding a specific word in a DNA dataset encoding the complete text of multiple literary works."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121661", "source_url": "https://hdl.handle.net/2142/121661", "pdf_url": "https://www.ideals.illinois.edu/items/128855/bitstreams/430304/data.pdf"}
{"type": ["Presentation"], "subject": ["Web Archives", "Quality Assurance", "Workflows", "Human-centered digital practitioners"], "creator": ["Lyon, Meghan"], "description": ["Building sustainable quality assurance practices is a challenge for today's preservationists, who want to be sure that content preserved in web archives is not only the correct content, but in working order. This often means that archived web content should be replayed via Wayback rendering software in good fidelity when compared to the original website. The exponentially growing scale of web archives necessitates a multipronged approach to identify what is (and is not) being preserved, and where improvements can be made. This paper will explore actions that can take place iteratively throughout the web archiving life cycle, as part of a larger system of review where multiple individuals can contribute, including non-technical Library staff and subject matter experts. The processes described are part of a novel workflow in the Library of Congress Web Archiving Program."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "title": ["QUALITY PRESERVATION: Emerging Quality Assurance Practices in the Library of Congress Web Archives [presentation]"], "date": ["2023", "2023-12-30T14:04:06-06:00"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121662", "source_url": "https://hdl.handle.net/2142/121662", "pdf_url": "https://www.ideals.illinois.edu/items/128856/bitstreams/430306/data.pdf"}
{"title": ["THE LONG AND WINDING ROAD: Implementing an Open-Source Workflow [presentation]"], "date": ["2023", "2023-12-31T11:33:14-06:00"], "type": ["Presentation"], "subject": ["open-source", "workflow", "software", "analysis"], "creator": ["Williamson, Karyn"], "description": ["This paper will discuss the recent work of the abrdn archive to create and put in place a fully open-source workflow, the barriers faced, and what was learnt from the experience. abrdn plc, an Edinburgh based investment company, is the first financial institution to implement a fully open-source digital preservation workflow. The following text provides an analysis of the work undertaken by the archive thus far, and argues that the least important aspect of implementing an open-source workflow is the software. Our journey has definitely been a long and winding road with many wrong turns, misleading directions, and occasional problems with running out of fuel, but the outcome has been positive and archive colleagues are keen to find out where the road will lead them next."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121663", "source_url": "https://hdl.handle.net/2142/121663", "pdf_url": "https://www.ideals.illinois.edu/items/128857/bitstreams/430308/data.pdf"}
{"title": ["CREATING AN END-TO-END PROCESS FOR IMPLEMENTING A DIGITAL ARCHIVING WORKFLOW: How we are putting theory into practice [presentation]"], "date": ["2023", "2023-12-31T11:37:02-06:00"], "type": ["Presentation"], "subject": ["Digital archiving", "workflows", "case study"], "creator": ["Konstantelos, Leo", "Yan, Emma"], "description": ["This paper presents the efforts of Archives and Special Collections (ASC) at the University of Glasgow to produce an end-to-end process for implementing our digital archiving workflow. This will be achieved by conducting a pilot project and in this paper we discuss the project, our methodology and outputs and outcomes."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121664", "source_url": "https://hdl.handle.net/2142/121664", "pdf_url": "https://www.ideals.illinois.edu/items/128858/bitstreams/430310/data.pdf"}
{"title": ["A QUESTION OF CHARACTER: How do we automatically recharacterize data at cloud scales? [presentation]"], "date": ["2023", "2023-12-31T11:41:50-06:00"], "type": ["Presentation"], "subject": ["Scalability", "Automation", "Characterization", "Preservation Actions"], "creator": ["O’Sullivan, Jack", "Clipsham, David", "Smith, Richard"], "description": ["Many preservation actions that we undertake on digital content are driven by the format of the content in question. Format information is often determined at the point of ingest and is not regularly updated as our knowledge of file formats improves over time. Periodically re-characterizing all content in a repository would ensure that we get more accurate identifications over time, but a more sustainable approach would be to only re-characterize content that was actually likely to have changed. Preservica’s new Automated Active Digital Preservation feature seeks to do exactly this, but even when considering only subsets of the data in our cloud systems, we are faced with significant challenges of scale. In this paper, we describe those challenges, the approach we have taken to implement the feature, and the testing we have performed to verify the viability of this approach."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121665", "source_url": "https://hdl.handle.net/2142/121665", "pdf_url": "https://www.ideals.illinois.edu/items/128859/bitstreams/430312/data.pdf"}
{"title": ["VIRTUALIZATION FOR PROCESSING AND ACCESSING DIGITAL ARCHIVES [presentation]"], "date": ["2023", "2023-12-31T11:45:59-06:00"], "type": ["Presentation"], "subject": ["Containerization", "desktop virtualization", "virtual machine", "special collections", "born-digital archives", "virtual reading room"], "creator": ["Black, Shelly", "Dietz, Brian", "Farrell, Matthew"], "description": ["At a basic level, virtualization [1] is the use of a host computer or server’s resources to run other computing environments. There are many ways in which virtualized computing environments may be deployed and interacted with, including using software to virtualize additional desktops on a local computer (e.g., VirtualBox, Hyper-V Manager, or VMWare) or accessing virtual command line interfaces hosted by a server or computer cluster [2],[3], and emulating old video game systems on contemporary hardware [4]. In this paper we discuss a cross-institutional collaboration on using containerization and desktop virtualization in digital curation at academic special collections libraries."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121666", "source_url": "https://hdl.handle.net/2142/121666", "pdf_url": "https://www.ideals.illinois.edu/items/128860/bitstreams/430314/data.pdf"}
{"title": ["(HOW) IT WORKS!: A manifesto .. towards establishing a functional software collection at the Vienna museum of science and technology [presentation]"], "date": ["2023", "2023-12-31T11:50:31-06:00"], "type": ["Presentation"], "subject": ["software collection", "strategy", "manifest", "open source", "embedded community"], "creator": ["Maltar, Nika", "Schilling, Almut"], "description": ["This paper presents the decision making process involved in establishing a software collection at the Vienna Museum of Science and Technology. The museum's collecting activities have been limited to the collection of tangible heritage. The current collection strategy defines the functionality of a museum object solely as its own material manifestation. That is why the museum keeps its physical collection in a “powered-off” state to preserve its integrity and functionality for the future. To integrate a functional software collection into this theoretical frame we are discussing applied terminology and have developed a manifesto to build on a solid theoretical foundation."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121667", "source_url": "https://hdl.handle.net/2142/121667", "pdf_url": "https://www.ideals.illinois.edu/items/128861/bitstreams/430316/data.pdf"}
{"title": ["PRIORITIZING STORAGE MEDIA FOR DIGITAL ARCHIVING AND PRESERVATION [presentation]"], "date": ["2023", "2023-12-31T11:54:57-06:00"], "type": ["Presentation"], "subject": ["digital archiving", "legacy storage media", "prioritization", "selection and appraisal"], "creator": ["Konstantelos, Leo", "Yan, Emma"], "description": ["This paper summarizes our efforts to-date at Archives & Special Collections, University of Glasgow, to develop a methodology and tool for prioritizing archival processing of digital collections stored in physical storage media. We present the sources and process we used to develop the methodology, and outline the functionality of a prototypical tool to generate prioritization scores."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121668", "source_url": "https://hdl.handle.net/2142/121668", "pdf_url": "https://www.ideals.illinois.edu/items/128862/bitstreams/430318/data.pdf"}
{"title": ["PRESERVING ONLINE JOURNALISTIC CONTENT IN DISRUPTIVE TIMES: The case of collection.news [presentation]"], "date": ["2023", "2023-12-31T12:00:48-06:00"], "type": ["Presentation"], "subject": ["collection.news", "archives-at-risk", "authoritarianism", "community archives", "Hong Kong"], "creator": ["Lui, Lok Hei"], "description": ["Journalistic content is a crucial part of history, yet its longevity always remains uncertain without proper curation and preservation. This is true in particular when it comes to journalistic content under authoritarian regime contexts, where freedom of the press and information freedom are usually in vain. The article explores the case of collection.news, a community initiative that crawled, disseminated and hosted the journalistic content of Apple Daily, a pro-democracy media outlet that was forcibly shut down by the authority in Hong Kong. By discussing the key events and tools used by collection.news initiative, the three distinctive features of it, namely exigency, decentralization, and anonymity, are highlighted. Finally, suggestions to the digital preservation field for supporting these community initiatives in authoritarian regimes will be given."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121669", "source_url": "https://hdl.handle.net/2142/121669", "pdf_url": "https://www.ideals.illinois.edu/items/128863/bitstreams/430320/data.pdf"}
{"title": ["MULTILINGUAL LABELS FOR DIGITAL PRESERVATION [presentation]"], "date": ["2023", "2023-12-31T12:07:20-06:00"], "type": ["Presentation"], "subject": ["Wikidata", "Semantic Web", "multilingual data", "knowledge graph subsets"], "creator": ["Thronton, Katherine", "Seals-Nutt, Kenneth"], "description": ["We introduce a technique for ﬁnding multilingual translations for lists of words using technologies of the Semantic Web. We present four subsets of data from Wikidata and Wikipedia as sources of multilingual labels. Our sample dataset consists of seven terms related to digital preservation. We compare the number of labels we can source for these terms from other human languages via SPARQL queries using the Wikidata Query Service. After discussing the composition of each subset, we detail their advantages and disadvantages. Providing multilingual la- bels as additional access points for resources such as on- tologies, vocabularies and user interfaces for applications increases the relevance of these resources to a larger per- centage of the global population. Increasing multilingual access promotes inclusion for a broader range of people, which leads to greater diversity in the digital preservation community."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121670", "source_url": "https://hdl.handle.net/2142/121670", "pdf_url": "https://www.ideals.illinois.edu/items/128864/bitstreams/430322/data.pdf"}
{"title": ["COMMUNITY ARCHIVES AT THE DIGITAL REPOSITORY OF IRELAND [presentation]"], "date": ["2023", "2023-12-31T12:11:11-06:00"], "type": ["Presentation"], "subject": ["Digital Archives", "Community Archives", "Digital Preservation", "Inclusion", "Membership", "Ireland", "Cultural Heritage data"], "creator": ["Griffith, Lisa", "Long, Kevin"], "description": ["The Community Archive Scheme is a bottom-up method of community engagement that the Digital Repository of Ireland (DRI) uses to work directly with no or low-income groups with digital material to preserve. The DRI's usual depositors are academic, cultural heritage, or public organisations and libraries with a long history of archiving who select material from their own collections for preservation. Through the Community Archive Scheme, we work in a hands-on way to provide digital preservation to a wider range of groups that fall outside of this sphere. The scheme celebrates its fifth anniversary in 2023 and during this period DRI has worked with nine voluntary groups to help preserve material on a variety of topics including the experience of asylum seekers in Ireland, maternal health, built heritage, LGBT rights and activism in Ireland. The types of material that we are working to preserve through this scheme vary from photographs of artists' works such as quilts, audio-visual material such as community documentaries, and documentaries produced for digital radio and social media. This paper will discuss how the scheme evolved, how these organisations have strengthened DRI as an organisation as well as making our community and collections more equitable and diverse, challenges we have encountered, some of the solutions we have developed, where our successes have come from and some of the future developments we are exploring so that we can continue to work with these groups."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121671", "source_url": "https://hdl.handle.net/2142/121671", "pdf_url": "https://www.ideals.illinois.edu/items/128865/bitstreams/430324/data.pdf"}
{"title": ["DIGITAL RECORDS CURATION AT THE EAST AND SOUTHERN AFRICAN UNIVERSITIES INSTITUTIONAL REPOSITORIES (IRS) [presentation]"], "date": ["2023", "2023-12-31T12:16:52-06:00"], "type": ["Presentation"], "subject": ["Botswana", "Kenya", "Universities", "Digital records curation", "Institutional repositories"], "creator": ["Erima, Juliet", "Mosweu, Tshepho L."], "description": ["Most of the knowledge generated in academic institutions today is in digital form. Given that institutional repositories (IRs) across universities receive, preserve and make access to digital assets. The aim of this study is to assess the status of digital curation at Institutional repositories in selected Universities in Botswana and Kenya. The study takes a quantitative approach whereby data was collected through survey questionnaires administered amongst university IR staff in Botswana and Kenya. The data collected was analysed and presented with tables and figures. The Open Archival Information System (OAIS) Functional Model was used in this study as a lens to investigate the problem. The findings of the study show that public universities in Botswana and Kenya have established IRs that ingest digital records into their custody. Most resources ingested include thesis and publications by academic staff and students. These IRs store their digital records on local servers and other storages like CDs. This study found that the majority of the IRs both in Botswana and Kenya do not have digital records preservation plans. This study recommends the use of the OAIS model to preserve, manage and make access to digital records at East and Southern African public Universities Institutional Repositories."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121672", "source_url": "https://hdl.handle.net/2142/121672", "pdf_url": "https://www.ideals.illinois.edu/items/128866/bitstreams/430326/data.pdf"}
{"title": ["THE VALORIZATION OF THE TUNISIAN RADIO ARCHIVE IN THE ARTIFICIAL INTELLIGENCE ERA [presentation]"], "date": ["2023", "2023-12-31T12:20:52-06:00"], "type": ["Presentation"], "subject": ["artificial intelligence", "image", "music", "Audiovisual", "chatbot"], "creator": ["Meddeb, Sami", "Cecchine, Randi"], "description": ["Radio Elyssa's sound archives face challenges in the post-revolution Tunisian context: preserving a large volume of digital content with limited resources while preserving Tunisia's cultural heritage. The Digital Cooperation Association Tunisia and Radio Elyssa are collaborating to test the potential of Artificial Intelligence tools to automate archival tasks. Before any automation, it is necessary to understand the regulatory procedures for digital archiving: identifying, classifying, migrating, and storing data according to best practices. Long-term preservation faces challenges due to limited resources and increasing digitization. The combination of human expertise and AI will enable Radio Elyssa to use AI responsibly to fulfill its mission."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121673", "source_url": "https://hdl.handle.net/2142/121673", "pdf_url": "https://www.ideals.illinois.edu/items/128867/bitstreams/430328/data.pdf"}
{"title": ["DIGITAL PRESERVATION AND ACCESSIBILITY OF ARCHIVES IN OMAN: Current Status and Future Directions [presentation]"], "date": ["2023", "2023-12-31T12:25:31-06:00"], "type": ["Presentation"], "subject": ["Digital preservation", "Oman", "Institutional archives", "Information management", "Accessibility"], "creator": ["Shehata, Ahmed Maher Khafaga", "Mkadmi, Abderrazak"], "description": ["Digital preservation significance is widely recognized and imperative for all institutions. It is a pressing concern for archival specialists who acknowledge its relevance and necessity in contemporary information management practices. The current paper aims to examine the present state of digital preservation and Accessibility of institutional archives in Oman and to ascertain the challenges and prospects in this domain. This research is conducted through a comprehensive analysis of the extant literature and semi-structured interviews with administrative personnel employed in both public and private institutions in Oman. Semi-structured interviews were conducted with ten professionals in governmental organizations, who were chosen based on their expertise and experience in the field, using purposive sampling. The findings showed that interviewees in Omani institutions value digital preservation for many reasons, such as compliance with Omani law on archives, improved organization and security, and ease of document access. However, all institutions have no unified application strategy for digital preservation. The findings revealed many challenges, including technological obsolescence, security risks, big data management, and human resource challenges."], "language": ["eng"], "relation": ["iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121674", "source_url": "https://hdl.handle.net/2142/121674", "pdf_url": "https://www.ideals.illinois.edu/items/128868/bitstreams/430330/data.pdf"}
{"creator": ["Wang, Hannah", "Farrell, Jess", "Mumma, Courtney", "Schaefer, Sibyl"], "date": ["2024-01-02T10:13:38-06:00", "2023"], "description": ["Operating from a foundation of shared values, the community-supported digital preservation services represented in the Digital Preservation Services Collaborative (DPSC) empower stewards of digital content to make informed decisions by offering transparency and accountability. These values have become increasingly important as resources for digital preservation fail to meet the needs of organizations, forcing many mission-critical digital preservation activities to be outsourced to commercial providers. In the DPSC Planning Project, this group of mission-aligned service providers are working to establish closer and more intentional collaboration between their organizations, in order to guarantee the continued availability of services that prioritize transparency and accountability to the cultural heritage organizations they serve. In this interactive panel, partners from the DPSC Planning Project will discuss the importance of the shared values for digital preservation good practice, how they have enacted these values within their organizations, and other project findings."], "language": ["eng"], "relation": ["Panel: https://hdl.handle.net/2142/121076", "iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Digital preservation", "collaboration", "values", "transparency", "accountability"], "title": ["FROM COMMUNITY-SUPPORTED VALUES TO ACTION: Operationalizing the Digital Preservation Declaration of Shared Values [presentation]"], "type": ["Presentation"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121675", "source_url": "https://hdl.handle.net/2142/121675", "pdf_url": "https://www.ideals.illinois.edu/items/128869/bitstreams/430332/data.pdf"}
{"creator": ["Guillermo Martinez, Antonio", "Fuertes, Maria"], "date": ["2024-01-02T10:26:51-06:00", "2023"], "description": ["This paper will review, from the perspective of one of the project winners, the success story of the ARCHIVER Project, highlighting the benefits achieved by leveraging the commercial digital preservation solutions for scientific research data through a pre-commercial procurement process, where end users were able to directly influence the expected functionalities in the platform and how they are expected to operate."], "language": ["eng"], "relation": ["Short Paper: https://hdl.handle.net/2142/121119"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Digital Preservation", "Research and Development", "Collaboration", "public-private"], "title": ["ARCHIVER PROJECT: A SUCCESSFUL PUBLIC-PRIVATE COLLABORATIVE PROJECT [presentation]"], "type": ["Presentation", "conference presentation"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121677", "source_url": "https://hdl.handle.net/2142/121677", "pdf_url": "https://www.ideals.illinois.edu/items/128871/bitstreams/430334/data.pdf"}
{"creator": ["Thorsted, Tyler"], "date": ["2024-01-02T10:59:43-06:00", "2023"], "description": ["Within the Digital Preservation Community there are many references to policies on file formats, acceptable file formats, preservation policies and strategies, risk matrices, and action plans. All have the intention of defining and describing file formats and guiding decisions on which formats to preserve how, and when. My team and I originally created a File Format Action Plan, which was later migrated from OneNote to Confluence and then included more strategic plans for hundreds of file formats. This paper explores which key elements should be included in an effective file format strategy and the different ways such data can be used by people and systems. What works for one institution may not work for another, and the work created by a larger institution may benefit those with smaller resources."], "language": ["eng"], "relation": ["Short Paper: https://hdl.handle.net/2142/121127", "iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["File Formats", "Documentation", "Registry"], "title": ["KEY ELEMENTS OF A FILE FORMAT STRATEGY: The only bad file format is one that hasn't been documented. [presentation]"], "type": ["text", "still image", "conference presentation"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121679", "source_url": "https://hdl.handle.net/2142/121679", "pdf_url": "https://www.ideals.illinois.edu/items/128873/bitstreams/430336/data.pdf"}
{"creator": ["Anderson, Bethany G.", "Caldrone, Sandi L.", "Henry, Joshua K.", "Imker, Heidi J.", "Margenot, Andrew J.", "Williams, Sarah C."], "date": ["2024-01-02T11:06:33-06:00", "2023"], "description": ["The Morrow Plots at the University of Illinois Urbana-Champaign are the longest-running continuous experimental agricultural fields in the Americas. At iPres 2022 we reported on work to curate, preserve, and visualize planting, treatment, and yield data collected from the plots' nearly 150-year history. This paper provides an update on these efforts over the past year and, with special emphasis on the data’s scientific and cultural value, discusses the importance of collaborative and interdisciplinary work within the Morrow Plots stakeholder community to publish the dataset, and identify necessary next steps."], "language": ["eng"], "relation": ["Long Paper: https://hdl.handle.net/2142/121097", "iPRES 2023"], "subject": ["data", "agriculture", "archives", "curation", "collaboration"], "title": ["PUBLISHING AGRICULTURAL DATA FROM THE MORROW PLOTS: The Value and Logistics of Preserving a Long-Term Research Experiment [presentation]"], "type": ["text", "still image", "conference paper"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121681", "source_url": "https://hdl.handle.net/2142/121681", "pdf_url": "https://www.ideals.illinois.edu/items/128875/bitstreams/430338/data.pdf"}
{"creator": ["Caballos, Almudena", "Knowles, Chris", "Cawthorn, Kate", "Guillermo Martinez, Antonio", "Fuertes, Maria"], "date": ["2024-01-02T11:17:08-06:00", "2023"], "description": ["Usually, the resulting digital preservation project is very different from its conception. The theory defined before starting a digital preservation project serves as a guide for the beginning of the project, but must be flexible enough to be adapted throughout the implementation to fit the real needs of the organization. In this panel, representatives of institutions from different GLAM-UR sectors from different countries will speak from their own experience about the evolution of a digital preservation project from its theoretical conception to its real practical implementation."], "language": ["eng"], "relation": ["Panel: https://hdl.handle.net/2142/121074", "iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Digital Preservation Project", "Digital Repositories", "Implementation"], "title": ["FROM THEORY TO PRACTICE: UNDERSTANDING THE EVOLUTION OF A DIGITAL PRESERVATION PROJECT FROM CONCEPTION TO FINAL REPOSITORY Some real cases [presentation]"], "type": ["text", "still image", "conference presentation"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121682", "source_url": "https://hdl.handle.net/2142/121682", "pdf_url": "https://www.ideals.illinois.edu/items/128876/bitstreams/430340/data.pdf"}
{"creator": ["McMeekin, Sharon", "Haunton, Melinda"], "date": ["2024-01-02T11:26:50-06:00", "2023"], "description": ["Over the last three years, The National Archives (UK) and the Digital Preservation Coalition have collaborated on the development of a growing body of training content under the banner of the “Novice to Know-How” learning pathway. The content has proved to be incredibly popular, opening the door to digital preservation training for individuals and organizations that previously had not been able or willing to engage with the topic. This paper will examine the projects motivations, outputs, impact, and future plans."], "language": ["eng"], "relation": ["Long Paper: https://hdl.handle.net/2142/121099", "iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Training", "Workforce Development", "Skills", "Collaboration"], "title": ["RUNNING UP THAT HILL: Making Digital Preservation Skills Accessible with Novice to Know-How [presentation]"], "type": ["text", "still image", "conference presentation"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121683", "source_url": "https://hdl.handle.net/2142/121683", "pdf_url": "https://www.ideals.illinois.edu/items/128877/bitstreams/430342/data.pdf"}
{"creator": ["Yunes, Erin", "Itchuaqiyaq, Cana Uluak", "Long, Kara"], "date": ["2024-01-02T11:33:59-06:00", "2023"], "description": ["Directed by an Inuit-led and serving tribal organization, Aqqaluk Trust, in the frontline hub-community of Kotzebue, Alaska, the Rematriation Project: Restoring and Sharing Inuit Knowledges aims to create capacity for and access to digital archives related to Inuit cultural, tribal, and scientific knowledges and history to assist tribes and communities in developing localized, culturally appropriate approaches and solutions to their needs. In partnership with a team of scholars from Virginia Tech (itself led by an Iñupiaq scholar from Kotzebue)—the goal of this project is to empower Indigenous communities through the lens of Indigenous data and research sovereignty to collect, control, interpret, and benefit from data that originates from their communities. The Rematriation Project operates on a foundation of community-first, community-led decision making that emphasizes Indigenous Data Sovereignty practices. This presentation outlines the goals and initiatives of the first phases of the project."], "language": ["eng"], "relation": ["Short Paper: https://hdl.handle.net/2142/121108", "iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Community Archives", "Preservation", "Indigenous Data Sovereignty", "Capacity Building", "Equitable Research"], "title": ["THE REMATRIATION PROJECT: Building Capacity for Community Digital Archiving in Northwest Alaska [presentation]"], "type": ["text", "still image", "conference presentation"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121684", "source_url": "https://hdl.handle.net/2142/121684", "pdf_url": "https://www.ideals.illinois.edu/items/128878/bitstreams/430344/data.pdf"}
{"creator": ["Lake, Sarah", "Richan, John"], "date": ["2024-01-02T11:39:38-06:00", "2023"], "description": ["Student-run papers, journals, and magazines that were previously published in print form are now almost exclusively hosted on digital publishing platforms. How will this shift impact the longevity of student scholarship and institutional memory? This paper will present an ongoing project that aims to archive web-based student publications at Concordia University. We will discuss the rationale behind the project, our initial objectives and scope, and the challenges that we have encountered so far. We will conclude with a discussion of future opportunities for outreach and other envisioned pathways for collaboration."], "language": ["eng"], "relation": ["Short Paper: https://hdl.handle.net/2142/121113", "iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["web archiving", "student publications", "university archives", "academic libraries", "Archive-It"], "title": ["TOWARDS PRESERVING WEB-BASED STUDENT PUBLICATIONS AT CONCORDIA UNIVERSITY [presentation]"], "type": ["text", "still image", "conference presentation"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121685", "source_url": "https://hdl.handle.net/2142/121685", "pdf_url": "https://www.ideals.illinois.edu/items/128879/bitstreams/430346/data.pdf"}
{"creator": ["Lischer-Katz, Zack", "Braggs, Rashida K.", "Carter, Bryan", "Bliedung von der Heide, Sven"], "date": ["2024-01-02T11:46:10-06:00", "2023"], "description": ["This panel explores the possibilities and challenges of volumetric video capture for digital humanities research and pedagogy, particularly in terms of documenting and representing the stories of BIPOC Americans who have lived through historical eras of global conflict. The panel will focus on the panelists’ experiences working with volumetric video and their work on a multi-institutional National Endowment for the Humanities-funded project. Panelists will offer perspectives on the benefits of volumetric video and its preservation challenges."], "language": ["eng"], "relation": ["Panel: https://hdl.handle.net/2142/121080", "iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["volumetric video", "immersive media", "digital storytelling", "inclusion", "preservation"], "title": ["VOLUMETRIC VIDEO FOR PRESERVATION: Exploring the Possibilities and Challenges for Immersive BIPOC Storytelling [presentation]"], "type": ["text", "still image", "conference presentation"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121686", "source_url": "https://hdl.handle.net/2142/121686", "pdf_url": "https://www.ideals.illinois.edu/items/128880/bitstreams/430348/data.pdf"}
{"creator": ["Ellis, Taryn"], "date": ["2024-01-02T11:54:40-06:00", "2023"], "description": ["It is not unusual to find at-risk obsolete carriers in archival collections, but these 3½ inch ADFS-formatted floppy disks hold original digital artworks from the late career of a pioneering Australian multimedia artist. The graphics files, created on an Acorn Archimedes in the late 80s and early 90s, had not been seen for more than 25 years, and the difficult process of preserving and providing access to these artworks, and their associated software, highlights the fragility of the material from this era. The case study presented here discusses how the State Library of South Australia combined open-source and community software to automate the extraction and migration of obsolete content from these disks while capturing filesystem and other metadata—and discovered that emulation is not always the simplest solution."], "language": ["eng"], "relation": ["Short Paper: https://hdl.handle.net/2142/121111", "iPRES 2023"], "subject": ["automation", "migration", "RISC OS", "born digital", "digital artwork"], "title": ["SAVING STAN: Preserving the Digital Artwork of Joseph Stanislaus Ostoja-Kotkowski [presentation]"], "type": ["text", "still image", "conference presentation"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121687", "source_url": "https://hdl.handle.net/2142/121687", "pdf_url": "https://www.ideals.illinois.edu/items/128881/bitstreams/430350/data.pdf"}
{"creator": ["Ville, Marion"], "date": ["2024-01-02T12:03:21-06:00", "2023"], "description": ["Emails are an essential medium of communication. Their management is an organizational, security, legal and financial issue for all organizations. The interdepartmental digital archiving Vitam program, which develops a digital archives management system on behalf of the French government, could not help but wonder about the acquisition, preservation and access to the documents and data contained in email archives. In 2013, it carried out a proof of concept on email archiving, at a time when few archive services in France had embarked on the acquisition of this type of document. Ten years later, the French landscape in terms of digital recordkeeping has changed significantly. In practice, some archives have put in place strategies for archiving email and tools have been made available to assist in their effort. This article looks at the transition from theory to practice of a more operational acquisition of this type of archive in a French context."], "language": ["eng"], "relation": ["Long Paper: https://hdl.handle.net/2142/121084", "iPRES 2023"], "rights": ["Copyright held by the author(s). The text of this presentation is published under a CC BY-SA license (https://creativecommons.org/licenses/by/4.0/)."], "subject": ["Email archiving", "Appraisal", "Preserving email", "Tools", "Proof of concept"], "title": ["2013 - 2023: A REVIEW OF TEN YEARS OF EMAIL ARCHIVING IN FRANCE [presentation]"], "type": ["text", "still image", "conference presentation"], "oai_identifier": "oai:www.ideals.illinois.edu:2142/121688", "source_url": "https://hdl.handle.net/2142/121688", "pdf_url": "https://www.ideals.illinois.edu/items/128882/bitstreams/430352/data.pdf"}
